{
    "Chapters": [
        {
            "chapter_number": "1",
            "chapter_title": "Number Systems",
            "topics": []
        },
        {
            "chapter_number": "3",
            "chapter_title": "Coordinate Geometry",
            "topics": [
                {
                    "section_number": "3.1",
                    "section_title": "Introduction",
                    "content": "You have already studied how to locate a point on a number line. You also know how to describe the position of a point on the line. There are many other situations, in which to find a point we are required to describe its position with reference to more than one line. For example, consider the following situations:\nI. In Fig. 3.1, there is a main road running in the East-West direction and streets with numbering from West to East. Also, on each street, house numbers are marked. To look for a friend's house here, is it enough to know only one reference point? For instance, if we only know that she lives on Street 2, will we be able to find her house easily? Not as easily as when we know two pieces of information about it, namely, the number of the street on which it is situated, and the house number. If we want to reach the house which is situated in the 2nd street and has the number 5, first of all we would identify the 2nd street and then the house numbered 5 on it. In Fig. 3.1, H shows the location of the house. Similarly, P shows the location of the house corresponding to Street number 7 and House number 4.\nII. Suppose you put a dot on a sheet of paper [Fig.3.2 (a)]. If we ask you to tell us the position of the dot on the paper, how will you do this? Perhaps you will try in some such manner: “The dot is in the upper half of the paper”, or “It is near the left edge of the paper”, or “It is very near the left hand upper corner of the sheet\". Do any of these statements fix the position of the dot precisely? No! But, if you say \" The dot is nearly 5 cm away from the left edge of the paper\", it helps to give some idea but still does not fix the position of the dot. A little thought might enable you to say that the dot is also at a distance of 9 cm above the bottom line. We now know exactly where the dot is!\nFor this purpose, we fixed the the position of the dot by specifying its distances from two fixed lines, the left edge of the paper and the bottom line of the paper [Fig.3.2 (b)]. In other words, we need two independent informations for finding the position of the dot.\nNow, perform the following classroom activity known as 'Seating Plan'.\nActivity 1 (Seating Plan) : Draw a plan of the seating in your classroom, pushing all the desks together. Represent each desk by a square. In each square, write the name of the student occupying the desk, which the square represents. Position of each student in the classroom is described precisely by using two independent informations:\n(i) the column in which she or he sits,\n(ii) the row in which she or he sits.\nIf you are sitting on the desk lying in the 5th column and 3rd row (represented by the shaded square in Fig. 3.3), your position could be written as (5, 3), first writing the column number, and then the row number. Is this the same as (3, 5)? Write down the names and positions of other students in your class. For example, if Sonia is sitting in the 4th column and 1st row, write S(4,1). The teacher's desk is not part of your seating plan. We are treating the teacher just as an observer.\nIn the discussion above, you observe that position of any object lying in a plane can be represented with the help of two perpendicular lines. In case of 'dot', we require distance of the dot from bottom line as well as from left edge of the paper. In case of seating plan, we require the number of the column and that of the row. This simple idea has far reaching consequences, and has given rise to a very important branch of Mathematics known as Coordinate Geometry. In this chapter, we aim to introduce some basic concepts of coordinate geometry. You will study more about these in your higher classes. This study was initially developed by the French philosopher and mathematician René Déscartes.\nRené Déscartes, the great French mathematician of the seventeenth century, liked to lie in bed and think! One day, when resting in bed, he solved the problem of describing the position of a point in a plane. His method was a development of the older idea of latitude and longitude. In honour of Déscartes, the system used for describing the position of a point in a plane is also known as the Cartesian system.",
                    "figure_table_number": "Fig. 3.1, Fig. 3.2, Fig. 3.3, Fig. 3.4"
                },
                {
                    "section_number": "3.2",
                    "section_title": "Cartesian System",
                    "content": "You have studied the number line in the chapter on 'Number System'. On the number line, distances from a fixed point are marked in equal units positively in one direction and negatively in the other. The point from which the distances are marked is called the origin. We use the number line to represent the numbers by marking points on a line at equal distances. If one unit distance represents the number '1', then 3 units distance represents the number ‘3', '0' being at the origin. The point in the positive direction at a distance r from the origin represents the number r. The point in the negative direction at a distance r from the origin represents the number -r. Locations of different numbers on the number line are shown in Fig. 3.5.\nDescartes invented the idea of placing two such lines perpendicular to each other on a plane, and locating points on the plane by referring them to these lines. The perpendicular lines may be in any direction such as in Fig.3.6. But, when we choose these two lines to locate a point in a plane in this chapter, one line will be horizontal and the other will be vertical, as in Fig. 3.6(c).\nThese lines are actually obtained as follows : Take two number lines, calling them X'X and Y'Y. Place X'X horizontal [as in Fig. 3.7(a)] and write the numbers on it just as written on the number line. We do the same thing with Y'Y except that Y'Y is vertical, not horizontal [Fig. 3.7(b)].\nCombine both the lines in such a way that the two lines cross each other at their zeroes, or origins (Fig. 3.8). The horizontal line X'X is called the x-axis and the vertical line YY' is called the y-axis. The point where X'X and Y'Y cross is called the origin, and is denoted by O. Since the positive numbers lie on the directions OX and OY, OX and OY are called the positive directions of the x-axis and the y-axis, respectively. Similarly, OX' and OY' are called the negative directions of the x-axis and the y-axis, respectively.\nYou observe that the axes (plural of the word 'axis') divide the plane into four parts. These four parts are called the quadrants (one fourth part), numbered I, II, III and IV anticlockwise from OX (see Fig.3.9). So, the plane consists of the axes and these quadrants. We call the plane, the Cartesian plane, or the coordinate plane, or the xy-plane. The axes are called the coordinate axes.\nNow, let us see why this system is so basic to mathematics, and how it is useful. Consider the following diagram where the axes are drawn on graph paper. Let us see the distances of the points P and Q from the axes. For this, we draw perpendiculars PM on the x-axis and PN on the y-axis. Similarly, we draw perpendiculars QR and QS as shown in Fig. 3.10.\nYou find that\n(i) The perpendicular distance of the point P from the y-axis measured along the positive direction of the x-axis is PN = OM = 4 units.\n(ii) The perpendicular distance of the point P from the x-axis measured along the positive direction of the y-axis is PM = ON = 3 units.\n(iii) The perpendicular distance of the point Q from the y-axis measured along the negative direction of the x-axis is OR = SQ = 6 units.\n(iv) The perpendicular distance of the point Q from the x-axis measured along the negative direction of the y-axis is OS = RQ = 2 units.\nNow, using these distances, how can we describe the points so that there is no confusion?\nWe write the coordinates of a point, using the following conventions:\n(i) The x coordinate of a point is its perpendicular distance from the y-axis measured along the x-axis (positive along the positive direction of the x-axis and negative along the negative direction of the x-axis). For the point P, it is + 4 and for Q, it is – 6. The x-coordinate is also called the abscissa.\n(ii) The y-coordinate of a point is its perpendicular distance from the x-axis measured along the y-axis (positive along the positive direction of the y-axis and negative along the negative direction of the y-axis). For the point P, it is + 3 and for Q, it is –2. The y-coordinate is also called the ordinate.\n(iii) In stating the coordinates of a point in the coordinate plane, the x-coordinate comes first, and then the y-coordinate. We place the coordinates in brackets. Hence, the coordinates of P are (4, 3) and the coordinates of Q are (– 6, – 2).\nNote that the coordinates describe a point in the plane uniquely. (3, 4) is not the same as (4, 3).\nExample 1: See Fig. 3.11 and complete the following statements:\n(i) The abscissa and the ordinate of the point B are ____ and ____ respectively. Hence, the coordinates of B are (_ _, _ _).\n(ii) The x-coordinate and the y-coordinate of the point M are ____ and ____ respectively. Hence, the coordinates of M are (_ _, _ _).\n(iii) The x-coordinate and the y-coordinate of the point L are ____ and ____ respectively. Hence, the coordinates of L are (_ _, _ _).\n(iv) The x-coordinate and the y-coordinate of the point S are ____ and ____ respectively. Hence, the coordinates of S are (_ _, _ _).\nExample 2: Write the coordinates of the points marked on the axes in Fig. 3.12.\nSolution: You can see that :\n(i) The point A is at a distance of + 4 units from the y-axis and at a distance zero from the x-axis. Therefore, the y-coordinate of A is 4 and the x-coordinate is 0. Hence, the coordinates of A are (4, 0).\n(ii) The coordinates of B are (0, 3). Why?\n(iii) The coordinates of C are (– 5, 0). Why?\n(iv) The coordinates of D are (0, – 4). Why?\n(v) The coordinates of E are (2, 0). Why?\nSince every point on the x-axis has no distance (zero distance) from the x-axis, therefore, the y-coordinate of every point lying on the x-axis is always zero. Thus, the coordinates of any point on the x-axis are of the form (x, 0), where x is the distance of the point from the y-axis. Similarly, the coordinates of any point on the y-axis are of the form (0, y), where y is the distance of the point from the x-axis. Why?\nWhat are the coordinates of the origin O? It has zero distance from both the axes so that its abscissa and ordinate are both zero. Therefore, the coordinates of the origin are (0, 0).\nIn the examples above, you may have observed the following relationship between the signs of the coordinates of a point and the quadrant of a point in which it lies.\n(i) If a point is in the 1st quadrant, then the point will be in the form (+, +), since the 1st quadrant is enclosed by the positive x-axis and the positive y-axis.\n(ii) If a point is in the 2nd quadrant, then the point will be in the form (-, +), since the 2nd quadrant is enclosed by the negative x-axis and the positive y-axis.\n(iii) If a point is in the 3rd quadrant, then the point will be in the form (−, –), since the 3rd quadrant is enclosed by the negative x-axis and the negative y-axis.\n(iv) If a point is in the 4th quadrant, then the point will be in the form (+, -), since the 4th quadrant is enclosed by the positive x-axis and the negative y-axis (see Fig. 3.13).",
                    "figure_table_number": "Fig. 3.5, Fig. 3.6, Fig. 3.7, Fig. 3.8, Fig. 3.9, Fig. 3.10, Fig. 3.11, Fig. 3.12, Fig. 3.13"
                }
            ],
            "metadata_of_topic": {
                "educational_context": {
                    "grade": "9",
                    "subject": "Mathematics",
                    "curriculum_board": "NCERT",
                    "chapter_number": "3",
                    "chapter_title": "Coordinate Geometry"
                },
                "source_information": {
                    "ncert": {
                        "source": "NCERT",
                        "book_title": "Mathematics_Textbook_Class_9",
                        "publisher": "NCERT",
                        "language": "English",
                        "content_type": "theory|definition|example",
                        "exercise_type": ""
                    }
                }
            }
        },
        {
            "chapter_number": "4",
            "chapter_title": "Linear Equations in Two Variables",
            "topics": [
                {
                    "section_number": "4.1",
                    "section_title": "Introduction",
                    "content": "In earlier classes, you have studied linear equations in one variable. Can you write\ndown a linear equation in one variable? You may say that x + 1 = 0, x + √2 = 0 and\n√2y + √3 = 0 are examples of linear equations in one variable. You also know that\nsuch equations have a unique (i.e., one and only one) solution. You may also remember\nhow to represent the solution on a number line. In this chapter, the knowledge of linear\nequations in one variable shall be recalled and extended to that of two variables. You\nwill be considering questions like: Does a linear equation in two variables have a\nsolution? If yes, is it unique? What does the solution look like on the Cartesian plane?\nYou shall also use the concepts you studied in Chapter 3 to answer these questions.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "4",
                            "chapter_title": "Linear Equations in Two Variables",
                            "section_number": "4.1",
                            "section_title": "Introduction",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "4.2",
                    "section_title": "Linear Equations",
                    "content": "While solving an equation, you must always keep the following points in mind:\nThe solution of a linear equation is not affected when:\n(i) the same number is added to (or subtracted from) both the sides of the equation.\n(ii) you multiply or divide both the sides of the equation by the same non-zero\nnumber.\nLet us now consider the following situation:\nIn a One-day International Cricket match between India and Sri Lanka played in\nNagpur, two Indian batsmen together scored 176 runs. Express this information in the\nform of an equation.\nHere, you can see that the score of neither of them is known, i.e., there are two\nunknown quantities. Let us use x and y ly to denote them. So, the number of runs scored\nby one of the batsmen is x, and the number of runs scored by the other is y. We know\nthat\nx + y = 176,\nwhich is the required equation.\nThis is an example of a linear equation in two variables. It is customary to denote\nthe variables in such equations by x and y, but other letters may also be used. Some\nexamples of linear equations in two variables are:\n1.2s + 3t = 5, p + 4q = 7, πu + 5v = 9 and √2 x − 7y = 3.\nNote that you can put these equations in the form 1.2s + 3t – 5 = 0,\np + 4q – 7 = 0, πu + 5v – 9 = 0 and √2 x − 7y – 3 = 0, respectively.\nSo, any equation which can be put in the form ax + by + c = 0, where a, b and c\nare real numbers, and a and b are not both zero, is called a linear equation in two\nvariables. This means that you can think of many many such equations.\nExample 1: Write each of the following equations in the form ax + by + c = 0 and\nindicate the values of a, b and c in each case:\n(i) 2x + 3y = 4.37 (ii) x − 4 = √3 y (iii) 4 = 5x – 3y (iv) 2x = y\nSolution: (i) 2x + 3y = 4.37 can be written as 2x + 3y – 4.37 = 0. Here a = 2, b = 3\nand c = – 4.37.\n(ii) The equation x – 4 = √3 y can be written as x - √3 y – 4 = 0. Here a = 1,\nb=-√3_and c = − 4.\n(iii) The equation 4 = 5x – 3y can be written as 5x – 3y – 4 = 0. Here a = 5, b = −3\nand c = – 4. Do you agree that it can also be written as -5x + 3y + 4 = 0 ? In this\ncase a = −5, b = 3 and c = 4.\n(iv) The equation 2x = y can be written as 2x – y + 0 = 0. Here a = 2, b = −1 and\nc = 0.\nEquations of the type ax + b = 0 are also examples of linear equations in two variables\nbecause they can be expressed as\nax + 0.y + b = 0\nFor example, 4 – 3x = 0 can be written as -3x + 0.y + 4 = 0.\nExample 2: Write each of the following as an equation in two variables:\n(i) x = -5 (ii) y = 2 (iii) 2x = 3 (iv) 5y = 2\nSolution: (i) x = −5 can be written as 1.x + 0.y = −5, or 1.x + 0.y + 5 = 0.\n(ii) y = 2 can be written as 0.x + 1.y = 2, or 0.x + 1.y − 2 = 0.\n(iii) 2x = 3 can be written as 2x + 0.y − 3 = 0.\n(iv) 5y = 2 can be written as 0.x + 5y – 2 = 0.",
                    "figure_table_number": [
                        "Fig. 4.1"
                    ],
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "4",
                            "chapter_title": "Linear Equations in Two Variables",
                            "section_number": "4.2",
                            "section_title": "Linear Equations",
                            "figure_table_number": "Fig. 4.1"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "4.3",
                    "section_title": "Solution of a Linear Equation",
                    "content": "You have seen that every linear equation in one variable has a unique solution. What\ncan you say about the solution of a linear equation involving two variables? As there\nare two variables in the equation, a solution means a pair of values, one for x and one\nfor y which satisfy the given equation. Let us consider the equation 2x + 3y = 12.\nHere, x = 3 and y = 2 is a solution because when you substitute x = 3 and y = 2 in the\nequation above, you find that\n2x + 3y = (2 × 3) + (3 × 2) = 12\nThis solution is written as an ordered pair (3, 2), first writing the value for x and\nthen the value for y. Similarly, (0, 4) is also a solution for the equation above.\nOn the other hand, (1, 4) is not a solution of 2x + 3y = 12, because on putting\nx = 1 and y = 4 we get 2x + 3y = 14, which is not 12. Note that (0, 4) is a solution but\nnot (4, 0).\nYou have seen at least two solutions for 2x + 3y = 12, i.e., (3, 2) and (0, 4). Can\nyou find any other solution? Do you agree that (6, 0) is another solution? Verify the\nsame. In fact, we can get many many solutions in the following way. Pick a value of\nyour choice for x (say x = 2) in 2x + 3y = 12. Then the equation reduces to 4 + 3y = 12,\n8\nwhich is a linear equation in one variable. On solving this, you get y = 3. So 2,\n3\nis\nanother solution of 2x + 3y = 12. Similarly, choosing x = -5, you find that the equation\nbecomes -10 + 3y = 12. This gives y =\n22\n3\n. So, -5,\n22\n3\nis another solution of\n2x + 3y = 12. So there is no end to different solutions of a linear equation in two\nvariables. That is, a linear equation in two variables has infinitely many solutions.\nExample 3: Find four different solutions of the equation x + 2y = 6.\nSolution: By inspection, x = 2, y = 2 is a solution because for x = 2, y = 2\nx + 2y = 2 + 4 = 6\nNow, let us choose x = 0. With this value of x, the given equation reduces to 2y = 6\nwhich has the unique solution y = 3. So x = 0, y = 3 is also a solution of x + 2y = 6.\nSimilarly, taking y = 0, the given equation reduces to x = 6. So, x = 6, y = 0 is a solution\nof x + 2y = 6 as well. Finally, let us take y = 1. The given equation now reduces to\nx + 2 = 6, whose solution is given by x = 4. Therefore, (4, 1) is also a solution of the\ngiven equation. So four of the infinitely many solutions of the given equation are:\n(2, 2), (0, 3), (6, 0) and (4, 1).\nRemark: Note that an easy way of getting a solution is to take x = 0 and get the\ncorresponding value of y. Similarly, we can put y = 0 and obtain the corresponding\nvalue of x.\nExample 4: Find two solutions for each of the following equations:\n(i) 4x + 3y = 12\n(ii) 2x + 5y = 0\n(iii) 3y + 4 = 0\nSolution: (i) Taking x = 0, we get 3y = 12, i.e., y = 4. So, (0, 4) is a solution of the\ngiven equation. Similarly, by taking y = 0, we get x = 3. Thus, (3, 0) is also a solution.\n(ii) Taking x = 0, we get 5y = 0, i.e., y = 0. So (0, 0) is a solution of the given equation.\nNow, if you take y = 0, you again get (0, 0) as a solution, which is the same as the\nearlier one. To get another solution, take x = 1, say. Then you can check that the\ncorresponding value of y is\n2\nSo 1, -\n5\n2\n5\nis another solution of 2x + 5y = 0.\n(iii) Writing the equation 3y + 4 = 0 as 0.x + 3y + 4 = 0, you will find that y =\nany value of x. Thus, two solutions can be given as\n4\n(0,-3)\n4\nand (1,-4).\n3\n3\nfor",
                    "figure_table_number": [],
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "4",
                            "chapter_title": "Linear Equations in Two Variables",
                            "section_number": "4.3",
                            "section_title": "Solution of a Linear Equation",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ],
            "metadata": {
                "educational_context": {
                    "grade": "9",
                    "subject": "Mathematics",
                    "curriculum_board": "NCERT"
                },
                "source_information": {
                    "ncert": {
                        "source": "NCERT",
                        "book_title": "Mathematics_Textbook_Class_9",
                        "publisher": "NCERT",
                        "language": "English",
                        "content_type": "theory",
                        "exercise_type": ""
                    }
                }
            }
        },
        {
            "chapter_number": "5",
            "chapter_title": "Introduction to Euclid's Geometry",
            "topics": [
                {
                    "topic": "Introduction",
                    "content": "The word 'geometry' comes form the Greek words ‘geo', meaning the ‘earth', and 'metrein', meaning 'to measure'. Geometry appears to have originated from the need for measuring land. This branch of mathematics was studied in various forms in every ancient civilisation, be it in Egypt, Babylonia, China, India, Greece, the Incas, etc. The people of these civilisations faced several practical problems which required the development of geometry in various ways.\nFor example, whenever the river Nile overflowed, it wiped out the boundaries between the adjoining fields of different land owners. After such flooding, these boundaries had to be redrawn. For this purpose, the Egyptians developed a number of geometric techniques and rules for calculating simple areas and also for doing simple constructions. The knowledge of geometry was also used by them for computing volumes of granaries, and for constructing canals and pyramids. They also knew the correct formula to find the volume of a truncated pyramid (see Fig. 5.1). You know that a pyramid is a solid figure, the base of which is a triangle, or square, or some other polygon, and its side faces are triangles converging to a point at the top.",
                    "figure_table_number": "Fig. 5.1",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "5",
                            "chapter_title": "Introduction to Euclid's Geometry",
                            "section_number": "5.1",
                            "section_title": "Introduction",
                            "figure_table_number": "Fig. 5.1"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Introduction (Continued)",
                    "content": "In the Indian subcontinent, the excavations at Harappa and Mohenjo-Daro, etc. show that the Indus Valley Civilisation (about 3000 BCE) made extensive use of geometry. It was a highly organised society. The cities were highly developed and very well planned. For example, the roads were parallel to each other and there was an underground drainage system. The houses had many rooms of different types. This shows that the town dwellers were skilled in mensuration and practical arithmetic.\nThe bricks used for constructions were kiln fired and the ratio length : breadth : thickness, of the bricks was found to be 4 : 2 : 1.\nIn ancient India, the Sulbasutras (800 BCE to 500 BCE) were the manuals of geometrical constructions. The geometry of the Vedic period originated with the construction of altars (or vedis) and fireplaces for performing Vedic rites. The location of the sacred fires had to be in accordance to the clearly laid down instructions about their shapes and areas, if they were to be effective instruments. Square and circular altars were used for household rituals, while altars whose shapes were combinations of rectangles, triangles and trapeziums were required for public worship. The sriyantra (given in the Atharvaveda) consists of nine interwoven isosceles triangles. These triangles are arranged in such a way that they produce 43 subsidiary triangles. Though accurate geometric methods were used for the constructions of altars, the principles behind them were not discussed.\nThese examples show that geometry was being developed and applied everywhere in the world. But this was happening in an unsystematic manner. What is interesting about these developments of geometry in the ancient world is that they were passed on from one generation to the next, either orally or through palm leaf messages, or by other ways. Also, we find that in some civilisations like Babylonia, geometry remained a very practical oriented discipline, as was the case in India and Rome. The geometry developed by Egyptians mainly consisted of the statements of results. There were no general rules of the procedure. In fact, Babylonians and Egyptians used geometry mostly for practical purposes and did very little to develop it as a systematic science.\nBut in civilisations like Greece, the emphasis was on the reasoning behind why certain constructions work. The Greeks were interested in establishing the truth of the statements they discovered using deductive reasoning (see Appendix 1).\nA Greek mathematician, Thales is credited with giving the first known proof. This proof was of the statement that a circle is bisected (i.e., cut into two equal parts) by its diameter. One of Thales' most famous pupils was Pythagoras (572 BCE), whom you have heard about. Pythagoras and his group discovered many geometric properties and developed the theory of geometry to a great extent. This process continued till 300 BCE. At that time Euclid, a teacher of mathematics at Alexandria in Egypt, collected all the known work and arranged it in his famous treatise,",
                    "figure_table_number": "Fig. 5.2",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "5",
                            "chapter_title": "Introduction to Euclid's Geometry",
                            "section_number": "5.1",
                            "section_title": "Introduction",
                            "figure_table_number": "Fig. 5.2"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Euclid's Definitions, Axioms and Postulates",
                    "content": "The Greek mathematicians of Euclid's time thought of geometry as an abstract model of the world in which they lived. The notions of point, line, plane (or surface) and so on were derived from what was seen around them. From studies of the space and solids in the space around them, an abstract geometrical notion of a solid object was developed.\nA solid has shape, size, position, and can be moved from one place to another. Its boundaries are called surfaces. They separate one part of the space from another, and are said to have no thickness. The boundaries of the surfaces are curves or straight lines. These lines end in points.\nConsider the three steps from solids to points (solids-surfaces-lines-points). In each step we lose one extension, also called a dimension. So, a solid has three dimensions, a surface has two, a line has one and a point has none. Euclid summarised these statements as definitions. He began his exposition by listing 23 definitions in Book 1 of the ‘Elements’. A few of them are given below :\n1. A point is that which has no part.\n2. A line is breadthless length.\n3. The ends of a line are points.\n4. A straight line is a line which lies evenly with the points on itself.\n5. A surface is that which has length and breadth only.\n6. The edges of a surface are lines.\n7. A plane surface is a surface which lies evenly with the straight lines on itself.\nIf you carefully study these definitions, you find that some of the terms like part, breadth, length, evenly, etc. need to be further explained clearly. For example, consider his definition of a point. In this definition, ‘a part' needs to be defined. Suppose if you define 'a part' to be that which occupies 'area', again 'an area' needs to be defined. So, to define one thing, you need to define many other things, and you may get a long chain of definitions without an end. For such reasons, mathematicians agree to leave some geometric terms undefined. However, we do have a intuitive feeling for the geometric concept of a point than what the 'definition' above gives us. So, we represent a point as a dot, even though a dot has some dimension.\nA similar problem arises in Definition 2 above, since it refers to breadth and length, neither of which has been defined. Because of this, a few terms are kept undefined while developing any course of study. So, in geometry, we take a point, a line and a plane (in Euclid's words a plane surface) as undefined terms. The only thing is that we can represent them intuitively, or explain them with the help of 'physical models'.\nStarting with his definitions, Euclid assumed certain properties, which were not to be proved. These assumptions are actually 'obvious universal truths'. He divided them into two types: axioms and postulates. He used the term 'postulate' for the assumptions that were specific to geometry. Common notions (often called axioms), on the other hand, were assumptions used throughout mathematics and not specifically linked to geometry. For details about axioms and postulates, refer to Appendix 1. Some of Euclid's axioms, not in his order, are given below :\n(1) Things which are equal to the same thing are equal to one another.\n(2) If equals are added to equals, the wholes are equal.\n(3) If equals are subtracted from equals, the remainders are equal.\n(4) Things which coincide with one another are equal to one another.\n(5) The whole is greater than the part.\n(6) Things which are double of the same things are equal to one another.\n(7) Things which are halves of the same things are equal to one another.\nThese ‘common notions' refer to magnitudes of some kind. The first common notion could be applied to plane figures. For example, if an area of a triangle equals the area of a rectangle and the area of the rectangle equals that of a square, then the area of the triangle also equals the area of the square.\nMagnitudes of the same kind can be compared and added, but magnitudes of different kinds cannot be compared. For example, a line cannot be compared to a rectangle, nor can an angle be compared to a pentagon.\nThe 4th axiom given above seems to say that if two things are identical (that is, they are the same), then they are equal. In other words, everything equals itself. It is the justification of the principle of superposition. Axiom (5) gives us the definition of 'greater than'. For example, if a quantity B is a part of another quantity A, then A can be written as the sum of B and some third quantity C. Symbolically, A > B means that there is some C such that A = B + C.",
                    "figure_table_number": "Fig. 5.3",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "5",
                            "chapter_title": "Introduction to Euclid's Geometry",
                            "section_number": "5.2",
                            "section_title": "Euclid's Definitions, Axioms and Postulates",
                            "figure_table_number": "Fig. 5.3"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Euclid's Postulates",
                    "content": "Now let us discuss Euclid's five postulates. They are :\nPostulate 1 : A straight line may be drawn from any one point to any other point.\nNote that this postulate tells us that at least one straight line passes through two distinct points, but it does not say that there cannot be more than one such line. However, in his work, Euclid has frequently assumed, without mentioning, that there is a unique line joining two distinct points. We state this result in the form of an axiom as follows:\nAxiom 5.1: Given two distinct points, there is a unique line that passes through them.\nHow many lines passing through P also pass through Q (see Fig. 5.4)? Only one, that is, the line PQ. How many lines passing through Q also pass through P? Only one, that is, the line PQ. Thus, the statement above is self-evident, and so is taken as an axiom.\nPostulate 2 : A terminated line can be produced indefinitely.\nNote that what we call a line segment now-a-days is what Euclid called a terminated line. So, according to the present day terms, the second postulate says that a line segment can be extended on either side to form a line (see Fig. 5.5).\nPostulate 3 : A circle can be drawn with any centre and any radius.\nPostulate 4 : All right angles are equal to one another.\nPostulate 5 : If a straight line falling on two straight lines makes the interior angles on the same side of it taken together less than two right angles, then the two straight lines, if produced indefinitely, meet on that side on which the sum of angles is less than two right angles.\nFor example, the line PQ in Fig. 5.6 falls on lines AB and CD such that the sum of the interior angles 1 and 2 is less than 180° on the left side of PQ. Therefore, the lines AB and CD will eventually intersect on the left side of PQ.",
                    "figure_table_number": "Fig. 5.4, Fig. 5.5, Fig. 5.6",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "5",
                            "chapter_title": "Introduction to Euclid's Geometry",
                            "section_number": "5.2",
                            "section_title": "Euclid's Definitions, Axioms and Postulates",
                            "figure_table_number": "Fig. 5.4, Fig. 5.5, Fig. 5.6"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Euclid's Approach and Theorems",
                    "content": "A brief look at the five postulates brings to your notice that Postulate 5 is far more complex than any other postulate. On the other hand, Postulates 1 through 4 are so simple and obvious that these are taken as 'self-evident truths'. However, it is not possible to prove them. So, these statements are accepted without any proof (see Appendix 1). Because of its complexity, the fifth postulate will be given more attention in the next section.\nNow-a-days, 'postulates' and 'axioms' are terms that are used interchangeably and in the same sense. ‘Postulate' is actually a verb. When we say “let us postulate”, we mean, “let us make some statement based on the observed phenomenon in the Universe\". Its truth/validity is checked afterwards. If it is true, then it is accepted as a 'Postulate'.\nA system of axioms is called consistent (see Appendix 1), if it is impossible to deduce from these axioms a statement that contradicts any axiom or previously proved statement. So, when any system of axioms is given, it needs to be ensured that the system is consistent.\nAfter Euclid stated his postulates and axioms, he used them to prove other results. Then using these results, he proved some more results by applying deductive reasoning. The statements that were proved are called propositions or theorems. Euclid deduced 465 propositions in a logical chain using his axioms, postulates, definitions and theorems proved earlier in the chain. In the next few chapters on geometry, you will be using these axioms to prove some theorems.\nNow, let us see in the following examples how Euclid used his axioms and postulates for proving some of the results:\nExample 1: If A, B and C are three points on a line, and B lies between A and C (see Fig. 5.7), then prove that AB + BC = AC.\nSolution: In the figure given above, AC coincides with AB + BC. Also, Euclid's Axiom (4) says that things which coincide with one another are equal to one another. So, it can be deduced that AB + BC = AC.\nNote that in this solution, it has been assumed that there is a unique line passing through two points.\nExample 2: Prove that an equilateral triangle can be constructed on any given line segment.\nSolution: In the statement above, a line segment of any length is given, say AB [see Fig. 5.8(i)].\nHere, you need to do some construction. Using Euclid's Postulate 3, you can draw a circle with point A as the centre and AB as the radius [see Fig. 5.8(ii)]. Similarly, draw another circle with point B as the centre and BA as the radius. The two circles meet at a point, say C. Now, draw the line segments AC and BC to form ∆ ABC [see Fig. 5.8 (iii)].\nSo, you have to prove that this triangle is equilateral, i.e., AB = AC = BC.\nNow, AB = AC, since they are the radii of the same circle (1)\nSimilarly, AB = BC (Radii of the same circle) (2)\nFrom these two facts, and Euclid's axiom that things which are equal to the same thing are equal to one another, you can conclude that AB = BC = AC.\nSo, ∆ ABC is an equilateral triangle.\nNote that here Euclid has assumed, without mentioning anywhere, that the two circles drawn with centres A and B will meet each other at a point.\nNow we prove a theorem, which is frequently used in different results:\nTheorem 5.1 : Two distinct lines cannot have more than one point in common.\nProof: Here we are given two lines l and m. We need to prove that they have only one point in common.\nFor the time being, let us suppose that the two lines intersect in two distinct points, say P and Q. So, you have two lines passing through two distinct points P and Q. But this assumption clashes with the axiom that only one line can pass through two distinct points. So, the assumption that we started with, that two lines can pass through two distinct points is wrong.\nFrom this, what can we conclude? We are forced to conclude that two distinct lines cannot have more than one point in common.",
                    "figure_table_number": "Fig. 5.7, Fig. 5.8, Fig. 5.9",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "5",
                            "chapter_title": "Introduction to Euclid's Geometry",
                            "section_number": "5.2",
                            "section_title": "Euclid's Definitions, Axioms and Postulates",
                            "figure_table_number": "Fig. 5.7, Fig. 5.8, Fig. 5.9"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example|theorem",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "6",
            "chapter_title": "LINES AND ANGLES",
            "topics": [
                {
                    "section_number": "6.1",
                    "section_title": "Introduction",
                    "content": "In Chapter 5, you have studied that a minimum of two points are required to draw a line. You have also studied some axioms and, with the help of these axioms, you proved some other statements. In this chapter, you will study the properties of the angles formed when two lines intersect each other, and also the properties of the angles formed when a line intersects two or more parallel lines at distinct points. Further you will use these properties to prove some statements using deductive reasoning (see Appendix 1). You have already verified these statements through some activities in the earlier classes.\nIn your daily life, you see different types of angles formed between the edges of plane surfaces. For making a similar kind of model using the plane surfaces, you need to have a thorough knowledge of angles. For instance, suppose you want to make a model of a hut to keep in the school exhibition using bamboo sticks. Imagine how you would make it? You would keep some of the sticks parallel to each other, and some sticks would be kept slanted. Whenever an architect has to draw a plan for a multistoried building, she has to draw intersecting lines and parallel lines at different angles. Without the knowledge of the properties of these lines and angles, do you think she can draw the layout of the building?\nIn science, you study the properties of light by drawing the ray diagrams. For example, to study the refraction property of light when it enters from one medium to the other medium, you use the properties of intersecting lines and parallel lines. When two or more forces act on a body, you draw the diagram in which forces are represented by directed line segments to study the net effect of the forces on the body. At that time, you need to know the relation between the angles when the rays (or line segments) are parallel to or intersect each other. To find the height of a tower or to find the distance of a ship from the light house, one needs to know the angle formed between the horizontal and the line of sight. Plenty of other examples can be given where lines and angles are used. In the subsequent chapters of geometry, you will be using these properties of lines and angles to deduce more and more useful properties.\nLet us first revise the terms and definitions related to lines and angles learnt in earlier classes.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.1",
                            "section_title": "Introduction",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.2",
                    "section_title": "Basic Terms and Definitions",
                    "content": "Recall that a part (or portion) of a line with two end points is called a line-segment and a part of a line with one end point is called a ray. Note that the line segment AB is denoted by AB, and its length is denoted by AB. The ray AB is denoted by AB, and a line is denoted by AB. However, we will not use these symbols, and will denote the line segment AB, ray AB, length AB and line AB by the same symbol, AB. The meaning will be clear from the context. Sometimes small letters l, m, n, etc. will be used to denote lines.\nIf three or more points lie on the same line, they are called collinear points; otherwise they are called non-collinear points.\nRecall that an angle is formed when two rays originate from the same end point. The rays making an angle are called the arms of the angle and the end point is called the vertex of the angle. You have studied different types of angles, such as acute angle, right angle, obtuse angle, straight angle and reflex angle in earlier classes (see Fig. 6.1).",
                    "figure_table_number": "Fig. 6.1 : Types of Angles",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.2",
                            "section_title": "Basic Terms and Definitions",
                            "figure_table_number": "Fig. 6.1"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.2",
                    "section_title": "Basic Terms and Definitions",
                    "content": "An acute angle measures between 0° and 90°, whereas a right angle is exactly equal to 90°. An angle greater than 90° but less than 180° is called an obtuse angle. Also, recall that a straight angle is equal to 180°. An angle which is greater than 180° but less than 360° is called a reflex angle. Further, two angles whose sum is 90° are called complementary angles, and two angles whose sum is 180° are called supplementary angles.\nYou have also studied about adjacent angles in the earlier classes (see Fig. 6.2). Two angles are adjacent, if they have a common vertex, a common arm and their non-common arms are on different sides of the common arm. In Fig. 6.2, ∠ ABD and ∠ DBC are adjacent angles. Ray BD is their common arm and point B is their common vertex. Ray BA and ray BC are non common arms. Moreover, when two angles are adjacent, then their sum is always equal to the angle formed by the two non-common arms. So, we can write\n∠ ABC = ∠ ABD + / DBC.\nNote that / ABC and ∠ ABD are not adjacent angles. Why? Because their non-common arms BD and BC lie on the same side of the common arm BA.\nIf the non-common arms BA and BC in Fig. 6.2, form a line then it will look like Fig. 6.3. In this case, ∠ ABD and ∠ DBC are called linear pair of angles.\nYou may also recall the vertically opposite angles formed when two lines, say AB and CD, intersect each other, say at the point O (see Fig. 6.4). There are two pairs of vertically opposite angles.\nOne pair is ∠AOD and ∠BOC. Can you find the other pair?",
                    "figure_table_number": "Fig. 6.2 : Adjacent angles, Fig. 6.3 : Linear pair of angles, Fig. 6.4 : Vertically opposite angles",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.2",
                            "section_title": "Basic Terms and Definitions",
                            "figure_table_number": "Fig. 6.2, Fig. 6.3, Fig. 6.4"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.3",
                    "section_title": "Intersecting Lines and Non-intersecting Lines",
                    "content": "Draw two different lines PQ and RS on a paper. You will see that you can draw them in two different ways as shown in Fig. 6.5 (i) and Fig. 6.5 (ii).\nRecall the notion of a line, that it extends indefinitely in both directions. Lines PQ and RS in Fig. 6.5 (i) are intersecting lines and in Fig. 6.5 (ii) are parallel lines. Note that the lengths of the common perpendiculars at different points on these parallel lines is the same. This equal length is called the distance between two parallel lines.",
                    "figure_table_number": "Fig. 6.5 : Different ways of drawing two lines",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.3",
                            "section_title": "Intersecting Lines and Non-intersecting Lines",
                            "figure_table_number": "Fig. 6.5"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.4",
                    "section_title": "Pairs of Angles",
                    "content": "In Section 6.2, you have learnt the definitions of some of the pairs of angles such as complementary angles, supplementary angles, adjacent angles, linear pair of angles, etc. Can you think of some relations between these angles? Now, let us find out the relation between the angles formed when a ray stands on a line.\nDraw a figure in which a ray stands on a line as shown in Fig. 6.6. Name the line as AB and the ray as OC. What are the angles formed at the point O? They are ∠ AOC, ∠BOC and ∠ AОВ.\nCan we write ∠ AOC + ∠ BOC = ∠ AOB?\nYes! (Why? Refer to adjacent angles in Section 6.2)\nWhat is the measure of ∠ AOB? It is 180°. (Why?)\nFrom (1) and (2), can you say that ∠ AOC + ∠ BOC = 180°? Yes! (Why?)\nFrom the above discussion, we can state the following Axiom:",
                    "figure_table_number": "Fig. 6.6 : Linear pair of angles",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.4",
                            "section_title": "Pairs of Angles",
                            "figure_table_number": "Fig. 6.6"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.4",
                    "section_title": "Pairs of Angles",
                    "content": "Axiom 6.1: If a ray stands on a line, then the sum of two adjacent angles so formed is 180°.\nRecall that when the sum of two adjacent angles is 180°, then they are called a linear pair of angles.\nIn Axiom 6.1, it is given that 'a ray stands on a line'. From this ‘given', we have concluded that 'the sum of two adjacent angles so formed is 180°'. Can we write Axiom 6.1 the other way? That is, take the 'conclusion' of Axiom 6.1 as ‘given' and the 'given' as the 'conclusion'. So it becomes:\n(A) If the sum of two adjacent angles is 180°, then a ray stands on a line (that is, the non-common arms form a line).\nNow you see that the Axiom 6.1 and statement (A) are in a sense the reverse of each others. We call each as converse of the other. We do not know whether the statement (A) is true or not. Let us check. Draw adjacent angles of different measures as shown in Fig. 6.7. Keep the ruler along one of the non-common arms in each case. Does the other non-common arm also lie along the ruler?",
                    "figure_table_number": "Fig. 6.7 : Adjacent angles with different measures",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.4",
                            "section_title": "Pairs of Angles",
                            "figure_table_number": "Fig. 6.7"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "axiom|theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.4",
                    "section_title": "Pairs of Angles",
                    "content": "You will find that only in Fig. 6.7 (iii), both the non-common arms lie along the ruler, that is, points A, O and B lie on the same line and ray OC stands on it. Also see that ∠AOC+∠ COB = 125° +55° = 180°. From this, you may conclude that statement (A) is true. So, you can state in the form of an axiom as follows:\nAxiom 6.2: If the sum of two adjacent angles is 180°, then the non-common arms of the angles form a line.\nFor obvious reasons, the two axioms above together is called the Linear Pair Axiom.\nLet us now examine the case when two lines intersect each other.\nTheorem 6.1 : If two lines intersect each other, then the vertically opposite angles are equal.\nProof: In the statement above, it is given that 'two lines intersect each other'. So, let AB and CD be two lines intersecting at O as shown in Fig. 6.8. They lead to two pairs of vertically opposite angles, namely,\n(i) ∠ AOC and ∠ BOD (ii) ∠ AOD and ∠ BOC.\nWe need to prove that ∠ AOC = ∠ BOD and ∠ AOD = ∠ BOC.\nNow, ray AOB stands on line CD.\nTherefore, ∠ AOC + ∠ AOD = 180° (Linear pair axiom) (1)\nCan we write ∠ AOD + ∠ BOD = 180°? Yes! (Why?)\nFrom (1) and (2), we can write\n∠ AOC + ∠ AOD = ∠ AOD + ∠ BOD\nThis implies that ∠ AOC = ∠ BOD (Refer Section 5.2, Axiom 3)\nSimilarly, it can be proved that ∠ AOD = ∠ BOC.\nNow, let us do some examples based on Linear Pair Axiom and Theorem 6.1.",
                    "figure_table_number": "Fig. 6.8 : Vertically opposite angles",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.4",
                            "section_title": "Pairs of Angles",
                            "figure_table_number": "Fig. 6.8"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "axiom|theorem|proof",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.4",
                    "section_title": "Pairs of Angles",
                    "content": "Example 1 : In Fig. 6.9, lines PQ and RS intersect each other at point O. If ∠ POR : ∠ ROQ = 5 : 7, find all the angles.\nSolution : ∠ POR +∠ ROQ = 180° (Linear pair of angles)\nBut ∠ POR : ∠ ROQ = 5 : 7 (Given)\nTherefore, ∠ POR = 5/(5+7) × 180° = 5/12 × 180° = 75°\nSimilarly, ∠ ROQ = 7/(5+7) × 180° = 7/12 × 180° = 105°\nNow, ∠ POS = ∠ROQ = 105° (Vertically opposite angles)\nand ∠ SOQ = ∠POR = 75° (Vertically opposite angles)\nExample 2 : In Fig. 6.10, ray OS stands on a line POQ. Ray OR and ray OT are angle bisectors of ∠ POS and ∠ SOQ, respectively. If ∠ POS = x, find / ROT.\nSolution: Ray OS stands on the line POQ.\nTherefore, ∠ POS + ∠ SOQ = 180°\nBut, ∠ POS = x\nTherefore, x + ∠ SOQ = 180°\nSo, ∠ SOQ = 180° − x\nNow, ray OR bisects ∠ POS, therefore, ∠ ROS = 1/2 × ∠ POS = 1/2 × x = x/2\nSimilarly, ∠ SOT = 1/2 × ∠ SOQ = 1/2 × (180° − x) = 90° − x/2\nNow, ∠ ROT = ∠ ROS + ∠ SOT = x/2 + 90° − x/2 = 90°",
                    "figure_table_number": "Fig. 6.9, Fig. 6.10",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.4",
                            "section_title": "Pairs of Angles",
                            "figure_table_number": "Fig. 6.9, Fig. 6.10"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.4",
                    "section_title": "Pairs of Angles",
                    "content": "Example 3 : In Fig. 6.11, OP, OQ, OR and OS are four rays. Prove that ∠ POQ + ∠ QOR + ∠ SOR + ∠ POS = 360°.\nSolution: In Fig. 6.11, you need to produce any of the rays OP, OQ, OR or OS backwards to a point. Let us produce ray OQ backwards to a point T so that TOQ is a line (see Fig. 6.12).\nNow, ray OP stands on line TOQ.\nTherefore, ∠ TOP + ∠ POQ = 180° (1) (Linear pair axiom)\nSimilarly, ray OS stands on line TOQ.\nTherefore, ∠ TOS + ∠ SOQ = 180°\nBut ∠ SOQ = ∠ SOR + ∠ QOR\nSo, (2) becomes ∠ TOS + ∠ SOR + ∠ QOR = 180° (3)\nNow, adding (1) and (3), you get\n∠ TOP + ∠ POQ + ∠ TOS + ∠ SOR + ∠ QOR = 180° + 180° = 360°\nBut ∠ TOP + ∠ TOS = ∠ POS\nTherefore, ∠ POQ + ∠ QOR + ∠ SOR + ∠ POS = 360°",
                    "figure_table_number": "Fig. 6.11, Fig. 6.12",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.4",
                            "section_title": "Pairs of Angles",
                            "figure_table_number": "Fig. 6.11, Fig. 6.12"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.5",
                    "section_title": "Lines Parallel to the Same Line",
                    "content": "If two lines are parallel to the same line, will they be parallel to each other? Let us check it. See Fig. 6.18 in which line m || line l and line n || line l.\nLet us draw a line t transversal for the lines, l, m and n. It is given that line m || line l and line n || line l.\nTherefore, ∠ 1 = ∠2 and ∠1 = ∠3 (Corresponding angles axiom)\nSo, ∠ 2 = ∠ 3 (Why?)\nBut ∠ 2 and ∠ 3 are corresponding angles and they are equal.\nTherefore, you can say that\nLine m || Line n (Converse of corresponding angles axiom)\nThis result can be stated in the form of the following theorem:\nTheorem 6.6: Lines which are parallel to the same line are parallel to each other.\nNote : The property above can be extended to more than two lines also.\nNow, let us solve some examples related to parallel lines.\nExample 4: In Fig. 6.19, if PQ || RS, ∠ MXQ = 135° and ∠ MYR = 40°, find ∠ XMY.\nSolution: Here, we need to draw a line AB parallel to line PQ, through point M as shown in Fig. 6.20. Now, AB || PQ and PQ || RS.",
                    "figure_table_number": "Fig. 6.18, Fig. 6.19, Fig. 6.20",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.5",
                            "section_title": "Lines Parallel to the Same Line",
                            "figure_table_number": "Fig. 6.18, Fig. 6.19, Fig. 6.20"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|theorem|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.5",
                    "section_title": "Lines Parallel to the Same Line",
                    "content": "Therefore, AB || RS (Why?)\nNow, ∠ QXM + ∠ XMB = 180° (AB || PQ, Interior angles on the same side of the transversal XM)\nBut ∠ QXM = 135°\nSo, 135° + ∠ XMB = 180°\nTherefore, ∠ XMB = 45° (1)\nNow, ∠ BMY = ∠ MYR (AB || RS, Alternate angles)\nTherefore, ∠ BMY = 40° (2)\nAdding (1) and (2), you get\n∠ XMB + ∠ BMY = 45° + 40°\nThat is, ∠ XMY = 85°\nExample 5: If a transversal intersects two lines such that the bisectors of a pair of corresponding angles are parallel, then prove that the two lines are parallel.\nSolution: In Fig. 6.21, a transversal AD intersects two lines PQ and RS at points B and C respectively. Ray BE is the bisector of ∠ ABQ and ray CG is the bisector of ∠ BCS; and BE || CG.\nWe are to prove that PQ || RS.\nIt is given that ray BE is the bisector of ∠ ABQ.\nTherefore, ∠ ABE = 1/2 ∠ ABQ (1)\nSimilarly, ray CG is the bisector of ∠ BCS.\nTherefore, ∠ BCG = 1/2 ∠ BCS (2)\nBut BE || CG and AD is the transversal.\nTherefore, ∠ ABE = ∠ BCG (Corresponding angles axiom) (3)\nSubstituting (1) and (2) in (3), you get\n1/2 ∠ ABQ = 1/2 ∠ BCS\nThat is, ∠ ABQ = ∠ BCS\nBut, they are the corresponding angles formed by transversal AD with PQ and RS; and are equal.\nTherefore, PQ || RS (Converse of corresponding angles axiom)",
                    "figure_table_number": "Fig. 6.21",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.5",
                            "section_title": "Lines Parallel to the Same Line",
                            "figure_table_number": "Fig. 6.21"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "6.5",
                    "section_title": "Lines Parallel to the Same Line",
                    "content": "Example 6 : In Fig. 6.22, AB || CD and CD || EF. Also EA ⊥ AB. If ∠ BEF = 55°, find the values of x, y and z.\nSolution : y + 55° = 180° (Interior angles on the same side of the transversal ED)\nTherefore, y = 180° - 55° = 125°\nAgain x = y (AB || CD, Corresponding angles axiom)\nTherefore x = 125°\nNow, since AB || CD and CD || EF, therefore, AB || EF.\nSo, ∠ EAB + ∠ FEA = 180° (Interior angles on the same side of the transversal EA)\nTherefore, 90° + z + 55° = 180°\nWhich gives z = 180° - 145° = 35°.",
                    "figure_table_number": "Fig. 6.22, Fig. 6.23",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "6",
                            "chapter_title": "LINES AND ANGLES",
                            "section_number": "6.5",
                            "section_title": "Lines Parallel to the Same Line",
                            "figure_table_number": "Fig. 6.22, Fig. 6.23"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "7",
            "chapter_title": "TRIANGLES",
            "topics": [
                {
                    "section_number": "7.1",
                    "section_title": "Introduction",
                    "content": "You have studied about triangles and their various properties in your earlier classes. You know that a closed figure formed by three intersecting lines is called a triangle. ('Tri' means 'three'). A triangle has three sides, three angles and three vertices. For example, in triangle ABC, denoted as △ABC (see Fig. 7.1); AB, BC, CA are the three sides, ∠ A, ∠ B, ∠ C are the three angles and A, B, C are three vertices.\nIn Chapter 6, you have also studied some properties of triangles. In this chapter, you will study in details about the congruence of triangles, rules of congruence, some more properties of triangles and inequalities in a triangle. You have already verified most of these properties in earlier classes. We will now prove some of them.",
                    "figure_table_number": "Fig. 7.1",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "7",
                            "chapter_title": "TRIANGLES",
                            "section_number": "7.1",
                            "section_title": "Introduction",
                            "figure_table_number": "7.1"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "7.2",
                    "section_title": "Congruence of Triangles",
                    "content": "You must have observed that two copies of your photographs of the same size are identical. Similarly, two bangles of the same size, two ATM cards issued by the same bank are identical. You may recall that on placing a one rupee coin on another minted in the same year, they cover each other completely.\nDo you remember what such figures are called? Indeed they are called congruent figures ('congruent' means equal in all respects or figures whose shapes and sizes are both the same).\nNow, draw two circles of the same radius and place one on the other. What do you observe? They cover each other completely and we call them as congruent circles.\nRepeat this activity by placing one square on the other with sides of the same measure (see Fig. 7.2) or by placing two equilateral triangles of equal sides on each other. You will observe that the squares are congruent to each other and so are the equilateral triangles.\nYou may wonder why we are studying congruence. You all must have seen the ice tray in your refrigerator. Observe that the moulds for making ice are all congruent. The cast used for moulding in the tray also has congruent depressions (may be all are rectangular or all circular or all triangular). So, whenever identical objects have to be produced, the concept of congruence is used in making the cast.\nSometimes, you may find it difficult to replace the refill in your pen by a new one and this is so when the new refill is not of the same size as the one you want to remove. Obviously, if the two refills are identical or congruent, the new refill fits.\nSo, you can find numerous examples where congruence of objects is applied in daily life situations.\nCan you think of some more examples of congruent figures?\nNow, which of the following figures are not congruent to the square in Fig 7.3 (i) :\nThe large squares in Fig. 7.3 (ii) and (iii) are obviously not congruent to the one in Fig 7.3 (i), but the square in Fig 7.3 (iv) is congruent to the one given in Fig 7.3 (i).\nLet us now discuss the congruence of two triangles.\nYou already know that two triangles are congruent if the sides and angles of one triangle are equal to the corresponding sides and angles of the other triangle.\nNow, which of the triangles given below are congruent to triangle ABC in Fig. 7.4 (i)?\nCut out each of these triangles from Fig. 7.4 (ii) to (v) and turn them around and try to cover △ ABC. Observe that triangles in Fig. 7.4 (ii), (iii) and (iv) are congruent to △ ABC while △ TSU of Fig 7.4 (v) is not congruent to △ ABC.\nIf △ PQR is congruent to △ ABC, we write △ PQR = △ ABC.\nNotice that when △ PQR = △ ABC, then sides of △ PQR fall on corresponding equal sides of △ ABC and so is the case for the angles.\nThat is, PQ covers AB, QR covers BC and RP covers CA; ∠ P covers ∠ A, ∠ Q covers ∠ B and ∠ R covers ∠ C. Also, there is a one-one correspondence between the vertices. That is, P corresponds to A, Q to B, R to C and so on which is written as\nP ↔ A, Q ↔ B, R ↔ C\nSimilarly, for Fig. 7.4 (iii),\nNote that under this correspondence, △ PQR = △ABC; but it will not be correct to write △ QRP = △ ABC.\nFD ↔ AB, DE ↔ BC and EF ↔ CA\nand F↔ A, D ↔ B and E ↔ C\nSo, △ FDE = △ ABC but writing △ DEF = △ ABC is not correct.\nGive the correspondence between the triangle in Fig. 7.4 (iv) and △ ABC.\nSo, it is necessary to write the correspondence of vertices correctly for writing of congruence of triangles in symbolic form.\nNote that in congruent triangles corresponding parts are equal and we write in short ‘CPCT' for corresponding parts of congruent triangles.",
                    "figure_table_number": "Fig. 7.2, Fig. 7.3, Fig. 7.4",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "7",
                            "chapter_title": "TRIANGLES",
                            "section_number": "7.2",
                            "section_title": "Congruence of Triangles",
                            "figure_table_number": "7.2, 7.3, 7.4"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "7.3",
                    "section_title": "Criteria for Congruence of Triangles",
                    "content": "In earlier classes, you have learnt four criteria for congruence of triangles. Let us recall them.\nDraw two triangles with one side 3 cm. Are these triangles congruent? Observe that they are not congruent (see Fig. 7.5).\nNow, draw two triangles triangles with one side 4 cm and one angle 50° (see Fig. 7.6). Are they congruent?\nSee that these two triangles are not congruent.\nRepeat this activity with some more pairs of triangles.\nSo, equality of one pair of sides or one pair of sides and one pair of angles is not sufficient to give us congruent triangles.\nWhat would happen if the other pair of arms (sides) of the equal angles are also equal?\nIn Fig 7.7, BC = QR, ∠ B = ∠ Q and also, AB = PQ. Now, what can you say about congruence of △ABC and △ PQR?\nRecall from your earlier classes that, in this case, the two triangles are congruent. Verify this for △ ABC and △ PQR in Fig. 7.7.\nRepeat this activity with other pairs of triangles. Do you observe that the equality of two sides and the included angle is enough for the congruence of triangles? Yes, it is enough.\nThis is the first criterion for congruence of triangles.\nAxiom 7.1 (SAS congruence rule) : Two triangles are congruent if two sides and the included angle of one triangle are equal to the two sides and the included angle of the other triangle.\nThis result cannot be proved with the help of previously known results and so it is accepted true as an axiom (see Appendix 1).\nLet us now take some examples.\nExample 1: In Fig. 7.8, OA = OB and OD = OC. Show that\n(i) △ AOD = △ BOC and (ii) AD || BC.\nSolution : (i) You may observe that in △ AOD and △ BOC,\nOA = OB\nOD = OC\n(Given)\nAlso, since ∠ AOD and ∠ BOC form a pair of vertically opposite angles, we have\n∠AOD = ∠ BOC.\nSo,\n△ AOD = △ BOC\n(by the SAS congruence rule)\n(ii) In congruent triangles AOD and BOC, the other corresponding parts are also equal.\n∠OAD = ∠ OBC and these form a pair of alternate angles for line segments AD and BC.\nSo,\nTherefore,\nAD || BC.\nExample 2: AB is a line segment and line l is its perpendicular bisector. If a point P\nlies on l, show that P is equidistant from A and B.\nSolution : Line l⊥ AB and passes through C which\nis the mid-point of AB (see Fig. 7.9). You have to\nshow that PA = PB. Consider △ PCA and △ PCB.\nWe have\nAC = BC (C is the mid-point of AB)\n∠ PCA = ∠ PCB = 90°\nPC = PC\nSo, △ PCA = △ PCB (SAS rule)\nand so, PA = PB, as they are corresponding sides of congruent triangles.\nNow, let us construct two triangles, whose sides are 4 cm and 5 cm and one of the\nangles is 50° and this angle is not included in between the equal sides (see Fig. 7.10).\nAre the two triangles congruent?\nNotice that the two triangles are not congruent.\nRepeat this activity with more pairs of triangles. You will observe that for triangles\nto be congruent, it is very important that the equal angles are included between the\npairs of equal sides.\nSo, SAS congruence rule holds but not ASS or SSA rule.\nNext, try to construct the two triangles in which two angles are 60° and 45° and\nthe side included between these angles is 4 cm (see Fig. 7.11).\nCut out these triangles and place one triangle on the other. What do you observe?\nSee that one triangle covers the other completely; that is, the two triangles are congruent.\nRepeat this activity with more pairs of triangles. You will observe that equality of two\nangles and the included side is sufficient for congruence of triangles.\nThis result is the Angle-Side-Angle criterion for congruence and is written as\nASA criterion. You have verified this criterion in earlier classes, but let us state and\nprove this result.\nSince this result can be proved, it is called a theorem and to prove it, we use the\nSAS axiom for congruence.\nTheorem 7.1 (ASA congruence rule) : Two triangles are congruent if two angles\nand the included side of one triangle are equal to two angles and the included\nside of other triangle.\nProof: We are given two triangles ABC and DEF in which:\n∠B = ∠E, ∠C = ∠F\nand\nBC = EF\nWe need to prove that\n△ABC = △ DEF\nFor proving the congruence of the two triangles see that three cases arise.\nCase (i): Let AB = DE (see Fig. 7.12).\nNow what do you observe? You may observe that\nAB = DE\n(Assumed)\n∠B = ∠E\n(Given)\nBC = EF\n(Given)\nSo,\n△ ABC = △ DEF\n(By SAS rule)\nCase (ii): Let if possible AB > DE. So, we can take a point P on AB such that\nPB = DE. Now consider △ PBC and △ DEF (see Fig. 7.13).\nPB = DE\n(By construction)\n∠ B = ∠ E\n(Given)\nBC = EF\n(Given)\nSo, we can conclude that:\n△ PBC = △ DEF, by the SAS axiom for congruence.\nSince the triangles are congruent, their corresponding parts will be equal.\nSo,\n∠ PCB = ∠ DFE\nBut, we are given that\n∠ ACB = ∠ DFE\nSo,\n∠ ACB = ∠ PCB\nIs this possible?\nThis is possible only if P coincides with A.\nor,\nSo,\nBA = ED\n△ ABC = △ DEF\n(by SAS axiom)\nCase (iii): If AB < DE, we can choose a point M on DE such that ME = AB and\nrepeating the arguments as given in Case (ii), we can conclude that AB = DE and so,\n△ ABC = △ DEF.\nSuppose, now in two triangles two pairs of angles and one pair of corresponding\nsides are equal but the side is not included between the corresponding equal pairs of\nangles. Are the triangles still congruent? You will observe that they are congruent.\nCan you reason out why?\nYou know that the sum of the three angles of a triangle is 180°. So if two pairs of\nangles are equal, the third pair is also equal (180° – sum of equal angles).\nSo, two triangles are congruent if any two pairs of angles and one pair of\ncorresponding sides are equal. We may call it as the AAS Congruence Rule.\nNow let us perform the following activity :\nDraw triangles with angles 40°, 50° and 90°. How many such triangles can you\ndraw?\nIn fact, you can draw as many triangles as you want with different lengths of\nsides (see Fig. 7.14).\nObserve that the triangles may or may not be congruent to each other.\nSo, equality of three angles is not sufficient for congruence of triangles. Therefore,\nfor congruence of triangles out of three equal parts, one has to be a side.\nLet us now take some more examples.\nExample 3: Line-segment AB is parallel to another line-segment CD. O is the\nmid-point of AD (see Fig. 7.15). Show that (i) △ AOB = △ DOC (ii) O is also the\nmid-point of BC.\nSolution : (i) Consider △ AOB and △ DOC.\n∠ ABO = ∠ DCO\n(Alternate angles as AB || CD\nand BC is the transversal)\n∠ AOB = ∠ DOC\n(Vertically opposite angles)\nOA = OD\n(Given)\nTherefore,\n△ AOB = △ DOC\n(AAS rule)\n(ii)\nOB = OC\n(CPCT)\nSo, O is the mid-point of BC.",
                    "figure_table_number": "Fig. 7.5, Fig. 7.6, Fig. 7.7, Fig. 7.8, Fig. 7.9, Fig. 7.10, Fig. 7.11, Fig. 7.12, Fig. 7.13, Fig. 7.14, Fig. 7.15",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "7",
                            "chapter_title": "TRIANGLES",
                            "section_number": "7.3",
                            "section_title": "Criteria for Congruence of Triangles",
                            "figure_table_number": "7.5, 7.6, 7.7, 7.8, 7.9, 7.10, 7.11, 7.12, 7.13, 7.14, 7.15"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example|axiom",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "",
                    "section_title": "Some More Criteria for Congruence of Triangles",
                    "content": "You have seen earlier in this chapter that equality of three angles of one triangle to\nthree angles of the other is not sufficient for the congruence of the two triangles. You\nmay wonder whether equality of three sides of one triangle to three sides of another\ntriangle is enough for congruence of the two triangles. You have already verified in\nearlier classes that this is indeed true.\nTo be sure, construct two triangles with sides 4 cm, 3.5 cm and 4.5 cm\n(see Fig. 7.35). Cut them out and place them on each other. What do you observe?\nThey cover each other completely, if the equal sides are placed on each other. So, the\ntriangles are congruent.\nRepeat this activity with some more triangles. We arrive at another rule for\ncongruence.\nTheorem 7.4 (SSS congruence rule) : If three sides of one triangle are equal to\nthe three sides of another triangle, then the two triangles are congruent.\nThis theorem can be proved using a suitable construction.\nYou have already seen that in the SAS congruence rule, the pair of equal angles\nhas to be the included angle between the pairs of corresponding pair of equal sides and\nif this is not so, the two triangles may not be congruent.\nPerform this activity:\nConstruct two right angled triangles with hypotenuse equal to 5 cm and one side\nequal to 4 cm each (see Fig. 7.36).\nCut them out and place one triangle over the other with equal side placed on each\nother. Turn the triangles, if necessary. What do you observe?\nThe two triangles cover each other completely and so they are congruent. Repeat\nthis activity with other pairs of right triangles. What do you observe?\nYou will find that two right triangles are congruent if one pair of sides and the\nhypotenuse are equal. You have verified this in earlier classes.\nNote that, the right angle is not the included angle in this case.\nSo, you arrive at the following congruence rule:\nTheorem 7.5 (RHS congruence rule) : If in two two right triangles the hypotenuse\nand one side of one triangle are equal to the hypotenuse and one side of the\nother triangle, then the two triangles are congruent.\nNote that RHS stands for Right angle - Hypotenuse - Side.\nLet us now take some examples.\nExample 7: AB is a line-segment. P and Q are\npoints on opposite sides of AB such that each of them\nis equidistant from the points A and B (see Fig. 7.37).\nShow that the line PQ is the perpendicular bisector\nof AB.\nSolution: You are given that PA = PB and\nQA = QB and you are to show that PQ ⊥ AB and\nPQ bisects AB. Let PQ intersect AB at C.\nCan you think of two congruent triangles in this figure?\nLet us take △ PAQ and △ PBQ.\nIn these triangles,\nAP = BP\n(Given)\nAQ = BQ\n(Given)\nPQ = PQ\n(Common)\nSo,\n△ PAQ = △ PBQ\n(SSS rule)\nTherefore,\n∠ APQ = ∠ BPQ\n(CPCT).\nNow let us consider △ PAC and △ PBC.\nYou have :\nAP = BP\n(Given)\n∠ APC = ∠ BPC (Angles opposite to equal sides in\n△ APB)\nPC = PC\n(Common)\nSo,\n△ PAC = △ PBC\n(SAS rule)\nTherefore,\nAC = BC\n(CPCT) (1)\nand\n∠ ACP = ∠ BCP\n(CPCT)\nAlso,\n∠ ACP + ∠ BCP = 180°\n(Linear pair)\nSo,\n2∠ ACP = 180°\nor,\n∠ ACP = 90°\n(2)\nFrom (1) and (2), you can easily conclude that PQ is the perpendicular bisector of AB.\n[Note that, without showing the congruence of △ PAQ and △ PBQ, you cannot show\nthat △ APAC = △ APBC even though AP = BP\n(Given)\nand\n∠ PAC = ∠ PBC (Angles opposite to equal sides in\n△ APB)\nPC = PC\n(Common)\n△ PAC = △ PBC\n(SAS rule)\nIt is because these results give us SSA rule which is not always valid or true for\ncongruence of triangles. Also the angle is not included between the equal pairs of\nsides.]\nLet us take some more examples.\nExample 8: P is a point equidistant from two lines l and m intersecting at point A\n(see Fig. 7.38). Show that the line AP bisects the angle between them.\nSolution: You are given that lines l and m intersect each other at A. Let PB ⊥ l,\nPC ⊥ m. It is given that PB = PC.\nYou are to show that ∠ PAB = ∠ PAC.\nLet us consider △ PAB and △ PAC. In these two\ntriangles,\nPB = PC\n(Given)\n∠ PBA = ∠ PCA = 90°\n(Given)\nPA = PA\n(Common)\nSo,\n△ PAB = △ PAC\n(RHS rule)\nSo,\n∠ PAB = ∠ PAC\n(CPCT)\nNote that this result is the converse of the result proved in Q.5 of Exercise 7.1.",
                    "figure_table_number": "Fig. 7.35, Fig. 7.36, Fig. 7.37, Fig. 7.38",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "7",
                            "chapter_title": "TRIANGLES",
                            "section_number": "",
                            "section_title": "Some More Criteria for Congruence of Triangles",
                            "figure_table_number": "7.35, 7.36, 7.37, 7.38"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "7.4",
                    "section_title": "Some Properties of a Triangle",
                    "content": "In the above section you have studied two criteria for congruence of triangles. Let us\nnow apply these results to study some properties related to a triangle whose two sides\nare equal.\nPerform the activity given below:\nConstruct a triangle in which two sides are\nequal, say each equal to 3.5 cm and the third side\nequal to 5 cm (see Fig. 7.24). You have done such\nconstructions in earlier classes.\nDo you remember what is such a triangle\ncalled?\nA triangle in which two sides are equal is called\nan isosceles triangle. So, △ ABC of Fig. 7.24 is\nan isosceles triangle with AB = AC.\nNow, measure ∠ B and ∠ C. What do you observe?\nRepeat this activity with other isosceles triangles with different sides.\nYou may observe that in each such triangle, the angles opposite to the equal sides\nare equal.\nThis is a very important result and is indeed true for any isosceles triangle. It can\nbe proved as shown below.\nTheorem 7.2: Angles opposite to equal sides of an isosceles triangle are equal.\nThis result can be proved in many ways. One of\nthe proofs is given here.\nProof: We are given an isosceles triangle ABC\nin which AB = AC. We need to prove that\n∠ B = ∠ C.\nLet us draw the bisector of ∠ A and let D be\nthe point of intersection of this bisector of\n∠ A and BC (see Fig. 7.25).\nIn △ BAD and △ CAD,\nAB = AC\n(Given)\n∠ BAD = ∠ CAD\n(By construction)\nAD = AD\n(Common)\n(By SAS rule)\nSo,\n△ BAD = △ CAD\nSo, ∠ ABD = ∠ ACD, since they are corresponding angles of congruent triangles.\nSo,\n∠B = ∠C\nIs the converse also true? That is:\nIf two angles of any triangle are equal, can we conclude that the sides opposite to\nthem are also equal?\nPerform the following activity.\nConstruct a triangle ABC with BC of any length and ∠ B = ∠ C = 50°. Draw the\nbisector of ∠ A and let it intersect BC at D (see Fig. 7.26).\nCut out the triangle from the sheet of paper and fold it along AD so that vertex C\nfalls on vertex B.\nWhat can you say about sides AC and AB?\nObserve that AC covers AB completely\nA\nSo,\nAC = AB\nRepeat this activity with some more triangles.\nEach time you will observe that the sides opposite\nto equal angles are equal. So we have the\nfollowing:\nTheorem 7.3 : The sides opposite to equal angles\nangles of a triangle are equal.\nThis is the converse of Theorem 7.2.\nYou can prove this theorem by ASA congruence\nrule.\nLet us take some examples to apply these results.\nExample 4: In △ ABC, the bisector AD of ∠ A is perpendicular to side BC\n(see Fig. 7.27). Show that AB = AC and △ ABC is isosceles.\nSolution : In △ABD and △ACD,\n∠ BAD = ∠ CAD\n(Given)\nAD = AD\n(Common)\n∠ ADB = ∠ ADC = 90°\n(Given)\nSo,\n△ ABD = △ ACD\n(ASA rule)\nSo,\nAB = AC\n(CPCT)\nor, △ ABC is an isosceles triangle.\nExample 5: E and F are respectively the mid-points\nof equal sides AB and AC of △ ABC (see Fig. 7.28).\nShow that BF = CE.\nSolution: In △ ABF and △ ACE,\nAB = AC\n(Given)\n∠A = ∠A\n(Common)\nAF = AE (Halves of equal sides)\nSo,\n△ ABF = △ ACE\n(SAS rule)\nTherefore,\nBF = CE\n(CPCT)\nExample 6 : In an isosceles triangle ABC with AB = AC, D and E are points on BC\nsuch that BE = CD. Show that AD = AE.\nSolution : In △ ABD and △ ACE,\nAB = AC\n(Given) (1)\n∠B = ∠C\n(Angles opposite to equal sides) (2)\nAlso,\nBE = CD\nWe have BD = BE – DE\nBC = CD – BD\nLet's assume BE = CD. Then BD = CD\nWait! Let's rewrite. BE=CD. BC is common. So we need BD = CE. We are given BE = CD. We can write BD = BE and CD = CE.\nNo, that's not right. We are given AB=AC and BE=CD.\nWe know that BC = BD + DC and BC = BE + EC.\nTherefore, BD + DC = BE + EC.\nSince BE = CD, we have BD = EC.\nSo,\n△ ABD = △ ACE\n(Using (1), (2), and SAS rule)\nThis gives\nAD = AE\n(CPCT)",
                    "figure_table_number": "Fig. 7.24, Fig. 7.25, Fig. 7.26, Fig. 7.27, Fig. 7.28, Fig. 7.29",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "7",
                            "chapter_title": "TRIANGLES",
                            "section_number": "7.4",
                            "section_title": "Some Properties of a Triangle",
                            "figure_table_number": "7.24, 7.25, 7.26, 7.27, 7.28, 7.29"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "8",
            "chapter_title": "QUADRILATERALS",
            "topics": [
                {
                    "section_number": "8.1",
                    "section_title": "Properties of a Parallelogram",
                    "content": "A parallelogram is a quadrilateral in which both pairs of opposite sides are parallel.\n\nLet us perform an activity.\nCut out a parallelogram from a sheet of paper and cut it along a diagonal (see Fig. 8.1). You obtain two triangles. What can you say about these triangles?\nPlace one triangle over the other. Turn one around, if necessary. What do you observe?\nObserve that the two triangles are congruent to each other.\nRepeat this activity with some more parallelograms. Each time you will observe that each diagonal divides the parallelogram into two congruent triangles.\nLet us now prove this result.\n\nTheorem 8.1 : A diagonal of a parallelogram divides it into two congruent triangles.\nProof: Let ABCD be a parallelogram and AC be a diagonal (see Fig. 8.2). Observe that the diagonal AC divides parallelogram ABCD into two triangles, namely, A ABC and A CDA. We need to prove that these triangles are congruent.\nIn A ABC and A CDA, note that BC || AD and AC is a transversal.\nSo, ∠ BCA = ∠ DAC (Pair of alternate angles)\nAlso, AB || DC and AC is a transversal.\nSo, ∠ BAC = ∠ DCA (Pair of alternate angles)\nand AC = CA (Common)\nSo, Δ ABC ≅ ΔA CDA (ASA rule)\nor, diagonal AC divides parallelogram ABCD into two congruent triangles ABC and CDA.\n\nNow, measure the opposite sides of parallelogram ABCD. What do you observe?\nYou will find that AB = DC and AD = BC.\nThis is another property of a parallelogram stated below:\n\nTheorem 8.2 : In a parallelogram, opposite sides are equal.\nYou have already proved that a diagonal divides the parallelogram into two congruent triangles; so what can you say about the corresponding parts say, the corresponding sides? They are equal.\nSo, AB = DC and AD = BC\n\nNow what is the converse of this result? You already know that whatever is given in a theorem, the same is to be proved in the converse and whatever is proved in the theorem it is given in the converse. Thus, Theorem 8.2 can be stated as given below :\nIf a quadrilateral is a parallelogram, then each pair of its opposite sides is equal. So its converse is :\n\nTheorem 8.3 : If each pair of opposite sides of a quadrilateral is equal, then it is a parallelogram.\n\nCan you reason out why?\nLet sides AB and CD of the quadrilateral ABCD be equal and also_AD = BC (see Fig. 8.3). Draw diagonal AC.\nClearly, Δ ABC ≅ Δ CDA (Why?)\nSo, ∠ BAC = ∠ DCA (Why?)\nand ∠ BCA = ∠ DAC (Why?)\n\nCan you now say that ABCD is a parallelogram? Why?\nYou have just seen that in a parallelogram each pair of opposite sides is equal and conversely if each pair of opposite sides of a quadrilateral is equal, then it is a parallelogram. Can we conclude the same result for the pairs of opposite angles?\nDraw a parallelogram and measure its angles. What do you observe?\nEach pair of opposite angles is equal.\nRepeat this with some more parallelograms. We arrive at yet another result as given below.\n\nTheorem 8.4 : In a parallelogram, opposite angles are equal.\n\nNow, is the converse of this result also true? Yes. Using the angle sum property of a quadrilateral and the results of parallel lines intersected by a transversal, we can see that the converse is also true. So, we have the following theorem :\n\nTheorem 8.5 : If in a quadrilateral, each pair of opposite angles is equal, then it is a parallelogram.\n\nThere is yet another property of a parallelogram. Let us study the same. Draw a parallelogram ABCD and draw both its diagonals intersecting at the point O (see Fig. 8.4).\nMeasure the lengths of OA, OB, OC and OD.\nWhat do you observe? You will observe that OA = OC and OB = OD.\nor, O is the mid-point of both the diagonals.\nRepeat this activity with some more parallelograms. Each time you will find that O is the mid-point of both the diagonals.\nSo, we have the following theorem :\n\nTheorem 8.6: The diagonals of a parallelogram bisect each other.\n\nNow, what would happen, if in a quadrilateral the diagonals bisect each other? Will it be aparallelogram? Indeed this is true.\nThis result is the converse of the result of Theorem 8.6. It is given below:\n\nTheorem 8.7 : If the diagonals of a quadrilateral bisect each other, then it is a parallelogram.\n\nYou can reason out this result as follows:\nNote that in Fig. 8.5, it is given that OA = OC and OB = OD.\nSo, Δ ΑΟΒ ≅ ∆ COD (Why?)\nTherefore, ∠ ABO = ∠ CDO (Why?)\nFrom this, we get AB || CD\nSimilarly,\nBC || AD\nTherefore ABCD is a parallelogram.\n",
                    "figure_table_number": [
                        "Fig. 8.1",
                        "Fig. 8.2",
                        "Fig. 8.3",
                        "Fig. 8.4",
                        "Fig. 8.5"
                    ]
                },
                {
                    "section_number": "8.1",
                    "section_title": "Examples",
                    "content": "Example 1: Show that each angle of a rectangle is a right angle.\nSolution: Let us recall what a rectangle is.\nA rectangle is a parallelogram in which one angle is a right angle.\nLet ABCD be a rectangle in which ∠ A = 90°.\nWe have to show that ∠ B = ∠ C = ∠ D = 90°\nWe have, AD || BC and AB is a transversal (see Fig. 8.6).\nSo, ∠ A + ∠ B = 180°(Interior angles on the same side of the transversal)\nBut, ∠A = 90°\nSo, ∠ B = 180° – ∠ A = 180° - 90° = 90°\nNow, ∠ C = ∠ A and ∠ D = ∠ B (Opposite angles of the parallelogram)\nSo, ∠ C = 90° and ∠ D = 90°.\nTherefore, each of the angles of a rectangle is a right angle.\n\nExample 2: Show that the diagonals of a rhombus are perpendicular to each other.\nSolution: Consider the rhombus ABCD (see Fig. 8.7).\nYou know that AB = BC = CD = DA (Why?)\nNow, in A AOD and A COD,\nOA = OC (Diagonals of a parallelogram bisect each other)\nOD = OD (Common)\nAD = CD\nTherefore, Δ AOD ≅ Δ COD (SSS congruence rule)\nThis gives, ∠AOD = ∠ COD (CPCT)\nBut, ∠AOD + ∠ COD = 180° (Linear pair)\nSo, 2∠ AOD = 180°\nor, ∠AOD = 90°\nSo, the diagonals of a rhombus are perpendicular to each other.\n\nExample 3: ABC is an isosceles triangle in which AB = AC. AD bisects exterior angle PAC and CD || AB (see Fig. 8.8). Show that\n(i) / DAC = ∠ BCA_and (ii) ABCD is a parallelogram.\nSolution : (i) Δ ABC is isosceles in which AB = AC (Given)\nSo, ∠ ABC = ∠ACB (Angles opposite to equal sides)\nAlso, ∠ PAC = ∠ ABC + ∠ ACB (Exterior angle of a triangle)\nor, ∠ PAC = 2∠ACB\nNow, AD bisects ∠ PAC.\nSo, ∠ PAC = 2∠ DAC (1)\nTherefore, 2∠ DAC = 2∠ ACB [From (1) and (2)]\nor, ∠ DAC = ∠ ACB\n(ii) Now, these equal angles form a pair of alternate angles when line segments BC and AD are intersected by a transversal AC.\nSo, BC || AD\nAlso, BA || CD (Given)\nNow, both pairs of opposite sides of quadrilateral ABCD are parallel.\nSo, ABCD is a parallelogram.\n\nExample 4: Two parallel lines l and m are intersected by a transversal p (see Fig. 8.9). Show that the quadrilateral formed by the bisectors of interior angles is a rectangle.\nSolution: It is given that PS || QR and transversal p intersects them at points A and C respectively.\nThe bisectors of ∠ PAC and ∠ ACQ intersect at B and bisectors of ∠ ACR and ∠ SAC intersect at D.\nWe are to show that quadrilateral ABCD is a rectangle.\nNow, ∠ PAC = ∠ ACR (Alternate angles as l || m and p is a transversal)\nSo, 1/2 ∠ PAC = 1/2 ∠ ACR\ni.e., ∠ BAC = ∠ ACD\nThese form a pair of alternate angles for lines AB and DC with AC as transversal and they are equal also.\nSo, AB || DC\nSimilarly, BC || AD (Considering ∠ ACB and ∠ CAD)\nTherefore, quadrilateral ABCD is a parallelogram.\nAlso, ∠ PAC + ∠ CAS = 180° (Linear pair)\nSo, 1/2 ∠ PAC + 1/2 ∠ CAS = 1/2 × 180° = 90°\nor, ∠ BAC + ∠ CAD = 90°\nor, ∠ BAD = 90°\nSo, ABCD is a parallelogram in which one angle is 90°.\nTherefore, ABCD is a rectangle.\n\nExample 5: Show that the bisectors of angles of a parallelogram form a rectangle.\nSolution: Let P, Q, R and S be the points of intersection of the bisectors of ∠ A and ∠ B, ∠ B and ∠C, ∠ C and ∠ D, and ∠D and ∠ A respectively of parallelogram ABCD (see Fig. 8.10).\nIn A ASD, what do you observe?\nSince DS bisects ∠ D and AS bisects ∠ A, therefore,\n∠ DAS + ∠ ADS = 1/2 ∠ A + 1/2 ∠ D = 1/2 (∠ A + ∠ D)\n= 1/2 × 180° (∠ A and ∠ D are interior angles on the same side of the transversal)\n= 90°\nAlso, ∠DAS + ∠ ADS + ∠ DSA = 180° (Angle sum property of a triangle)\nor, 90° + ∠ DSA = 180°\nor, ∠ DSA = 90°\nSo, ∠ PSR = 90° (Being vertically opposite to ∠ DSA)\nSimilarly, it can be shown that ∠ APB = 90° or ∠ SPQ = 90° (as it was shown for ∠ DSA). Similarly, ∠ PQR = 90° and ∠ SRQ = 90°.\nSo, PQRS is a quadrilateral in which all angles are right angles.\nCan we conclude that it is a rectangle? Let us examine. We have shown that ∠ PSR = ∠ PQR = 90° and ∠ SPQ = ∠ SRQ = 90°. So both pairs of opposite angles are equal.\nTherefore, PQRS is a parallelogram in which one angle (in fact all angles) is 90° and so, PQRS is a rectangle.\n",
                    "figure_table_number": [
                        "Fig. 8.6",
                        "Fig. 8.7",
                        "Fig. 8.8",
                        "Fig. 8.9",
                        "Fig. 8.10"
                    ]
                },
                {
                    "section_number": "8.2",
                    "section_title": "The Mid-point Theorem",
                    "content": "You have studied many properties of a triangle as well as a quadrilateral. Now let us study yet another result which is related to the mid-point of sides of a triangle. Perform the following activity.\nDraw a triangle and mark the mid-points E and F of two sides of the triangle. Join the points E and F (see Fig. 8.15).\nMeasure EF and BC. Measure / AEF and ∠ ABC.\nWhat do you observe? You will find that :\nEF = 1/2 BC and / AEF = ∠ ABC\nso, EF || BC\nRepeat this activity with some more triangles.\nSo, you arrive at the following theorem:\n\nTheorem 8.8: The line segment joining the mid-points of two sides of a triangle is parallel to the third side.\nYou can prove this theorem using the following clue:\nObserve Fig 8.16 in which E and F are mid-points of AB and AC respectively and CD || BA.\n△ AEF ≅ ∆ CDF (ASA Rule)\nSo, EF = DF and BE = AE = DC (Why?)\nTherefore, BCDE is a parallelogram. (Why?)\nThis gives EF || BC.\n\nIn this case, also note that EF = 1/2 ED = 1/2 BC.\n\nCan you state the converse of Theorem 8.8? Is the converse true?\nYou will see that converse of the above theorem is also true which is stated as below:\n\nTheorem 8.9: The line drawn through the mid-point of one side of a triangle, parallel to another side bisects the third side.\nIn Fig 8.17, observe that E is the mid-point of AB, line l is passsing through E and is parallel to BC and CM || BA.\nProve that AF = CF by using the congruence of Δ AEF and Δ CDF.\n\nExample 6: In ∆ ABC, D, E and F are respectively the mid-points of sides AB, BC and CA (see Fig. 8.18). Show that Δ ABC is divided into four congruent triangles by joining D, E and F.\nSolution: As D and E are mid-points of sides AB and BC of the triangle ABC, by Theorem 8.8,\nDE || AC\nSimilarly,\nDF || BC and EF || AB\nTherefore ADEF, BDFE and DFCE are all parallelograms.\nNow DE is a diagonal of the parallelogram BDFE,\ntherefore, Δ BDE ≅ Δ FED\nSimilarly\nΔ DAF ≅ Δ FED\nand\nΔ EFC ≅ Δ FED\nSo, all the four triangles are congruent.\n\nExample 7: l, m and n are three parallel lines intersected by transversals p and q such that l, m and n cut off equal intercepts AB and BC on p (see Fig. 8.19). Show that l, m and n cut off equal intercepts DE and EF on q also.\nSolution : We are given that AB = BC and have to prove that DE = EF.\nLet us join A to F intersecting m at G..\nThe trapezium ACFD is divided into two triangles; namely Δ ACF and Δ AFD.\nNow, in Δ AFD, we can apply the same argument as G is the mid-point of AF, GE || AD and so by Theorem 8.9, E is the mid-point of DF,\ni.e., DE = EF.\nIn other words, l, m and n cut off equal intercepts on q also.\n",
                    "figure_table_number": [
                        "Fig. 8.15",
                        "Fig. 8.16",
                        "Fig. 8.17",
                        "Fig. 8.18",
                        "Fig. 8.19"
                    ]
                }
            ],
            "metadata": {
                "grade": "9",
                "subject": "Mathematics",
                "source": "NCERT"
            }
        },
        {
            "chapter_number": "9",
            "chapter_title": "Circles",
            "topics": [
                {
                    "section_number": "9.1",
                    "section_title": "Angle Subtended by a Chord at a Point",
                    "content": "Take a line segment PQ and a point R not on the line containing PQ. Join PR and QR (see Fig. 9.1). Then ∠ PRQ is called the angle subtended by the line segment PQ at the point R. What are angles POQ, PRQ and PSQ called in Fig. 9.2? ∠ POQ is the angle subtended by the chord PQ at the centre O, ∠ PRQ and ∠ PSQ are respectively the angles subtended by PQ at points R and S on the major and minor arcs PQ.",
                    "figure_table_number": "Fig. 9.1, Fig. 9.2"
                },
                {
                    "section_number": "9.1",
                    "section_title": "Theorem 9.1 : Equal chords of a circle subtend equal angles at the centre.",
                    "content": "Proof: You are given two equal chords AB and CD of a circle with centre O (see Fig.9.4). You want to prove that ∠AOB = ∠ COD.\nIn triangles AOB and COD,\nOA = OC (Radii of a circle)\nOB = OD (Radii of a circle)\nAB = CD (Given)\nΔΑΟΒ = ∆ COD (SSS rule)\n∠AOB = ∠ COD (Corresponding parts of congruent triangles)\nRemark: For convenience, the abbreviation CPCT will be used in place of 'Corresponding parts of congruent triangles', because we use this very frequently as you will see.",
                    "figure_table_number": "Fig. 9.4"
                },
                {
                    "section_number": "9.1",
                    "section_title": "Theorem 9.2 : If the angles subtended by the chords of a circle at the centre are equal, then the chords are equal.",
                    "content": "The above theorem is the converse of the Theorem 9.1. Note that in Fig. 9.4, if you take ∠AOB = ∠ COD, then\nΔ AOB = Δ COD (Why?)\nCan you now see that AB = CD?",
                    "figure_table_number": "Fig. 9.4"
                },
                {
                    "section_number": "9.2",
                    "section_title": "Perpendicular from the Centre to a Chord",
                    "content": "Draw a circle on a tracing paper. Let O be its centre. Draw a chord AB. Fold the paper along a line through O so that a portion of the chord falls on the other. Let the crease cut AB at the point M. Then, ∠ OMA = ∠ OMB = 90° or OM is perpendicular to AB. Does the point B coincide with A (see Fig.9.6)?\nYes it will. So MA = MB.\nGive a proof yourself by joining OA and OB and proving the right triangles OMA and OMB to be congruent. This example is a particular instance of the following result:",
                    "figure_table_number": "Fig. 9.6"
                },
                {
                    "section_number": "9.2",
                    "section_title": "Theorem 9.3: The perpendicular from the centre of a circle to a chord bisects the chord.",
                    "content": "What is the converse of this theorem? To write this, first let us be clear what is assumed in Theorem 9.3 and what is proved. Given that the perpendicular from the centre of a circle to a chord is drawn and to prove that it bisects the chord. Thus in the converse, what the hypothesis is ‘if a line from the centre bisects a chord of a circle' and what is to be proved is 'the line is perpendicular to the chord'. So the converse is:",
                    "figure_table_number": ""
                },
                {
                    "section_number": "9.2",
                    "section_title": "Theorem 9.4 : The line drawn through the centre of a circle to bisect a chord is perpendicular to the chord.",
                    "content": "Is this true? Try it for few cases and see. You will see that it is true for these cases. See if it is true, in general, by doing the following exercise. We will write the stages and you give the reasons.\nLet AB be a chord of a circle with centre O and O is joined to the mid-point M of AB. You have to prove that OM ⊥ AB. Join OA and OB (see Fig. 9.7). In triangles OAM and OBM,\nOA = OB (Why?)\nAM = BM (Why?)\nOM = OM (Common)\nTherefore, ΔΟΑΜ = ΔΟΒΜ (How?)\nThis gives ∠OMA = ∠OMB = 90° (Why?)",
                    "figure_table_number": "Fig. 9.7"
                },
                {
                    "section_number": "9.3",
                    "section_title": "Equal Chords and their Distances from the Centre",
                    "content": "Let AB be a line and P be a point. Since there are infinite numbers of points on a line, if you join these points to P, you will get infinitely many line segments PL1, PL2, PM, PL3, PL4, etc. Which of these is the distance of AB from P? You may think a while and get the answer. Out of these line segments, the perpendicular from P to AB, namely PM in Fig. 9.8, will be the least. In Mathematics, we define this least length PM to be the distance of AB from P. So you may say that:\nThe length of the perpendicular from a point to a line is the distance of the line from the point.\nNote that if the point lies on the line, the distance of the line from the point is zero.\nA circle can have infinitely many chords. You may observe by drawing chords of a circle that longer chord is nearer to the centre than the smaller chord. You may observe it by drawing several chords of a circle of different lengths and measuring their distances from the centre. What is the distance of the diameter, which is the longest chord from the centre? Since the centre lies on it, the distance is zero. Do you think that there is some relationship between the length of chords and their distances from the centre? Let us see if this is so.",
                    "figure_table_number": "Fig. 9.8"
                },
                {
                    "section_number": "9.3",
                    "section_title": "Theorem 9.5: Equal chords of a circle (or of congruent circles) are equidistant from the centre (or centres).",
                    "content": "Draw a circle of any radius on a tracing paper. Draw two equal chords AB and CD of it and also the perpendiculars OM and ON on them from the centre O. Fold the figure so that D falls on B and C falls on A [see Fig.9.9 (i)]. You may observe that O lies on the crease and N falls on M. Therefore, OM = ON. Repeat the activity by drawing congruent circles with centres O and O' and taking equal chords AB and CD one on each. Draw perpendiculars OM and O'N on them [see Fig. 9.9(ii)]. Cut one circular disc and put it on the other so that AB coincides with CD. Then you will find that O coincides with O' and M coincides with N. In this way you verified the following:",
                    "figure_table_number": "Fig. 9.9"
                },
                {
                    "section_number": "9.3",
                    "section_title": "Theorem 9.6: Chords equidistant from the centre of a circle are equal in length.",
                    "content": "Next, it will be seen whether the converse of this theorem is true or not. For this, draw a circle with centre O. From the centre O, draw two line segments OL and OM of equal length and lying inside the circle [see Fig. 9.10(i)]. Then draw chords PQ and RS of the circle perpendicular to OL and OM respectively [see Fig 9.10(ii)]. Measure the lengths of PQ and RS. Are these different? No, both are equal. Repeat the activity for more equal line segments and drawing the chords perpendicular to them. This verifies the converse of the Theorem 9.5 which is stated as follows:",
                    "figure_table_number": "Fig. 9.10"
                },
                {
                    "section_number": "9.3",
                    "section_title": "Example 1",
                    "content": "If two intersecting chords of a circle make equal angles with the diameter passing through their point of intersection, prove that the chords are equal.\nSolution: Given that AB and CD are two chords of a circle, with centre O intersecting at a point E. PQ is a diameter through E, such that ∠ AEQ = ∠ DEQ (see Fig.9.11). You have to prove that AB = CD.\nDraw perpendiculars OL and OM on chords AB and CD, respectively. Now\n∠ LOE = 180° – 90° – ∠ LEO = 90° – ∠ LEO (Angle sum property of a triangle)\n= 90° – ∠ MEO = ∠ MOE\n= 90° – ∠ AEQ = 90° – ∠ DEQ\nIn triangles OLE and OME,\n/ LEO = ∠ MEO (Why ?)\n∠ LOE = ∠ MOE (Proved above)\nEO = EO (Common)\nTherefore, Δ OLE = Δ OME (Why?)\nThis gives\nOL = OM (CPCT)\nSo,\nAB = CD (Why?)",
                    "figure_table_number": "Fig. 9.11"
                },
                {
                    "section_number": "9.4",
                    "section_title": "Angle Subtended by an Arc of a Circle",
                    "content": "You have seen that the end points of a chord other than diameter of a circle cuts it into two arcs – one major and other minor. If you take two equal chords, what can you say about the size of arcs? Is one arc made by first chord equal to the corresponding arc made by another chord? In fact, they are more than just equal in length. They are congruent in the sense that if one arc is put on the other, without bending or twisting, one superimposes the other completely.\nYou can verify this fact by cutting the arc, corresponding to the chord CD from the circle along CD and put it on the corresponding arc made by equal chord AB. You will find that the arc CD superimpose the arc AB completely (see Fig. 9.13). This shows that equal chords make congruent arcs and conversely congruent arcs make equal chords of a circle. You can state it as follows:\nIf two chords of a circle are equal, then their corresponding arcs are congruent and conversely, if two arcs are congruent, then their corresponding chords are equal.",
                    "figure_table_number": "Fig. 9.13"
                },
                {
                    "section_number": "9.4",
                    "section_title": "Definition of Angle Subtended by an Arc",
                    "content": "Also the angle subtended by an arc at the centre is defined to be angle subtended by the corresponding chord at the centre in the sense that the minor arc subtends the angle and the major arc subtends the reflex angle. Therefore, in Fig 9.14, the angle subtended by the minor arc PQ at O is ∠POQ and the angle subtended by the major arc PQ at O is reflex angle POQ.\nIn view of the property above and Theorem 9.1, the following result is true:\nCongruent arcs (or equal arcs) of a circle subtend equal angles at the centre.\nTherefore, the angle subtended by a chord of a circle at its centre is equal to the angle subtended by the corresponding (minor) arc at the centre. The following theorem gives the relationship between the angles subtended by an arc at the centre and at a point on the circle.",
                    "figure_table_number": "Fig. 9.14"
                },
                {
                    "section_number": "9.4",
                    "section_title": "Theorem 9.7 : The angle subtended by an arc at the centre is double the angle subtended by it at any point on the remaining part of the circle.",
                    "content": "Proof: Given an arc PQ of a circle subtending angles POQ at the centre O and PAQ at a point A on the remaining part of the circle. We need to prove that ∠ POQ = 2 ∠ PAQ.\nConsider the three different cases as given in Fig. 9.15. In (i), arc PQ is minor; in (ii), arc PQ is a semicircle and in (iii), arc PQ is major.\nLet us begin by joining AO and extending it to a point B.\nIn all the cases,\n∠ BOQ = ∠ OAQ + ∠ AQO\nbecause an exterior angle of a triangle is equal to the sum of the two interior opposite angles.\nAlso in Δ OAQ,\nOA = OQ (Radii of a circle)\nTherefore, ∠ OAQ = ∠ OQA (Theorem 7.5)\n∠ BOQ = 2 ∠ OAQ (1)\nSimilarly,\n∠ BOP = 2 ∠ OAP (2)\nFrom (1) and (2),\n∠ BOP + ∠ BOQ = 2(∠ OAP + ∠ OAQ)\nThis is the same as\n∠ POQ = 2 ∠ PAQ (3)\nFor the case (iii), where PQ is the major arc, (3) is replaced by\nreflex angle POQ = 2 ∠ PAQ\nRemark: Suppose we join points P and Q and form a chord PQ in the above figures. Then ∠ PAQ is also called the angle formed in the segment PAQP.\nIn Theorem 9.7, A can be any point on the remaining part of the circle. So if you take any other point C on the remaining part of the circle (see Fig. 9.16), you have\n∠ POQ = 2 ∠ 2 / PCQ = 2 / PAQ\nTherefore,\n∠ PCQ = ∠ PAQ.\nThis proves the following:",
                    "figure_table_number": "Fig. 9.15, Fig. 9.16"
                },
                {
                    "section_number": "9.4",
                    "section_title": "Theorem 9.8 : Angles in the same segment of a circle are equal.",
                    "content": "Again let us discuss the case (ii) of Theorem 10.8 separately. Here ∠PAQ is an angle in the segment, which is a semicircle. Also, ∠ PAQ = 1/2 ∠ POQ = 1/2 × 180° = 90°.\nIf you take any other point C on the semicircle, again you get that ∠ PCQ = 90°\nTherefore, you find another property of the circle as:\nAngle in a semicircle is a right angle.\nThe converse of Theorem 9.8 is also true. It can be stated as:\nTheorem 9.9: If a line segment joining two points subtends equal angles at two other points lying on the same side of the line containing the line segment, the four points lie on a circle (i.e. they are concyclic).",
                    "figure_table_number": ""
                },
                {
                    "section_number": "9.5",
                    "section_title": "Cyclic Quadrilaterals",
                    "content": "A quadrilateral ABCD is called cyclic if all the four vertices of it lie on a circle (see Fig 9.18). You will find a peculiar property in such quadrilaterals. Draw several cyclic quadrilaterals of different sides and name each of these as ABCD. (This can be done by drawing several circles of different radii and taking four points on each of them.)\nMeasure the opposite angles and write your observations in the following table.",
                    "figure_table_number": "Fig. 9.18"
                },
                {
                    "section_number": "9.5",
                    "section_title": "Theorem 9.10: The sum of either pair of opposite angles of a cyclic quadrilateral is 180°.",
                    "content": "You find that ∠A + ∠C = 180° and ∠B + ∠D = 180°, neglecting the error in measurements. This verifies the following:\nIn fact, the converse of this theorem, which is stated below is also true.\nTheorem 9.11: If the sum of a pair of opposite angles of a quadrilateral is 180°, the quadrilateral is cyclic.\nYou can see the truth of this theorem by following a method similar to the method adopted for Theorem 9.9.",
                    "figure_table_number": ""
                },
                {
                    "section_number": "9.5",
                    "section_title": "Example 2",
                    "content": "In Fig. 9.19, AB is a diameter of the circle, CD is a chord equal to the radius of the circle. AC and BD when extended intersect at a point E. Prove that ∠ AEB = 60°.\nSolution: Join OC, OD and BC.\nTriangle ODC is equilateral\nTherefore, ∠ COD = 60°\nNow,\n∠ CBD = 1/2 ∠ COD (Theorem 9.7)\nThis gives\n∠ CBD = 30°\nAgain,\n∠ ACB = 90°\nSo,\n∠ BCE = 180° – ∠ ACB = 90° – ∠ ACB = 90°\nWhich gives ∠ CEB = 180° – ∠ BCE – ∠ CBE = 180° – 90° – 30° = 60°, i.e., ∠ AEB = 60°.",
                    "figure_table_number": "Fig. 9.19"
                },
                {
                    "section_number": "9.5",
                    "section_title": "Example 3",
                    "content": "In Fig 9.20, ABCD is a cyclic quadrilateral in which AC and BD are its diagonals.\nIf ∠ DBC = 55° and ∠ BAC = 45°, find ∠ BCD.\nSolution :\n∠ CAD = ∠ DBC = 55° (Angles in the same segment)\nTherefore, ∠ DAB = ∠ CAD + ∠ BAC\n= 55° + 45° = 100°\nBut ∠ DAB + ∠ BCD = 180° (Opposite angles of a cyclic quadrilateral)\nSo, ∠ BCD = 180° – 100° = 80°.",
                    "figure_table_number": "Fig. 9.20"
                },
                {
                    "section_number": "9.5",
                    "section_title": "Example 4",
                    "content": "Two circles intersect at two points A and B. AD and AC are diameters to the two circles (see Fig. 9.21). Prove that B lies on the line segment DC.\nSolution: Join AB.\n∠ ABD = 90° (Angle in a semicircle)\n∠ ABC = 90°(Angle in a semicircle)\nSo, ∠ABD + ∠ ABC = 90° + 90° = 180°\nTherefore, DBC is a line. That is B lies on the line segment DC.",
                    "figure_table_number": "Fig. 9.21"
                },
                {
                    "section_number": "9.5",
                    "section_title": "Example 5",
                    "content": "Prove that the quadrilateral formed (if possible) by the internal angle bisectors of any quadrilateral is cyclic.\nSolution: In Fig. 9.22, ABCD is a quadrilateral in which the angle bisectors AH, BF, CF and DH of internal angles A, B, C and D respectively form a quadrilateral EFGH.\nNow, ∠ FEH = ∠ AEB = 180° – ∠ EAB – ∠ EBA (Why ?)\n= 1/2 180° – 1/2 (∠ A + ∠ B)\nand ∠ FGH = ∠ CGD = 180° – ∠ GCD – ∠ GDC (Why?)\n= 180°- 1/2 (∠ C + ∠ D)\nTherefore, ∠ FEH + ∠ FGH = 180° – 1/2 (∠ A + ∠ B) + 180° – 1/2 (∠ C + ∠ D)\n= 360° – 1/2 (∠ A+ ∠ B + C +∠ D) = 360° – 1/2 × 360°\n= 360°-180° = 180°\nTherefore, by Theorem 9.11, the quadrilateral EFGH is cyclic.",
                    "figure_table_number": "Fig. 9.22"
                }
            ]
        },
        {
            "chapter_number": "10",
            "chapter_title": "HERON'S FORMULA",
            "topics": [
                {
                    "section_number": "10.1",
                    "section_title": "Area of a Triangle — by Heron's Formula",
                    "content": "We know that the area of triangle when its height is given, is\n1\n2\n× base × height. Now suppose that we know the lengths of the sides of a scalene triangle and not the height. Can you still find its area? For instance, you have a triangular park whose sides are 40 m, 32 m, and 24 m. How will you calculate its area? Definitely if you want to apply the formula, you will have to calculate its height. But we do not have a clue to calculate the height. Try doing so. If you are not able to get it, then go to the next section.\nHeron was born in about 10AD possibly in Alexandria in Egypt. He worked in applied mathematics. His works on mathematical and physical subjects are so numerous and varied that he is considered to be an encyclopedic writer in these fields. His geometrical works deal largely with problems on mensuration written in three books. Book I deals with the area of squares, rectangles, triangles, trapezoids (trapezia), various other specialised quadrilaterals, the regular polygons, circles, surfaces of cylinders, cones, spheres etc. In this book, Heron has derived the famous formula for the area of a triangle in terms of its three sides.\nThe formula given by Heron about the area of a triangle, is also known as Hero's formula. It is stated as:\nArea of a triangle = √s(s- a) (s – b) (s – c)\nwhere a, b and c are the sides of the triangle, and s = semi-perimeter, i.e., half the perimeter of the triangle = \na + b + c\n2\nThis formula is helpful where it is not possible to find the height of the triangle easily. Let us apply it to calculate the area of the triangular park ABC, mentioned above (see Fig. 10.2).\nLet us take a = 40 m, b = 24 m, c = 32 m,\nso that we have s =\n40 + 24 + 32\n2\nm = 48 m.\ns - a = (48 – 40) m = 8 m,\ns - b = (48 – 24) m = 24 m,\ns - c = (48 – 32) m = 16 m.\nTherefore, area of the park ABC\n= √s(s-a) (s – b) (s – c)\n= √48 × 8 × 24 × 16 m² = 384m²\nWe see that 32² + 24² = 1024 + 576 = 1600 = 40². Therefore, the sides of the park make a right triangle. The largest side, i.e., BC which is 40 m will be the hypotenuse and the angle between the sides AB and AC will be 90°.\nWe can check that the area of the park is\n1\n2\n× 32 × 24 m² = 384 m².\nWe find that the area we have got is the same as we found by using Heron's formula.\nNow using Heron's formula, you verify this fact by finding the areas of other triangles discussed earlier viz.,\n(i) equilateral triangle with side 10 cm.\n(ii) isosceles triangle with unequal side as 8 cm and each equal side as 5 cm.\nYou will see that\nFor (i), we have s =\n10+10+10\n2\ncm = 15 cm.\nArea of triangle = √15(15 – 10) (15 – 10) (15 – 10) cm²\n= √15 × 5 × 5 × 5 cm² = 25√3 cm²\nFor (ii), we have s =\n8+5+5\n2\ncm = 9 cm\nArea of triangle = √9(9-8) (9-5) (9 – 5) cm² = √9 × 1 × 4 × 4 cm² = 12 cm².\nLet us now solve some more examples:\nExample 1: Find the area of a triangle, two sides of which are 8 cm and 11 cm and the perimeter is 32 cm (see Fig. 10.3).\nSolution: Here we have perimeter of the triangle = 32 cm, a = 8 cm and b = 11 cm.\nThird side c = 32 cm - (8+11) cm = 13 cm\nSo, 2s = 32, i.e., s = 16 cm,\ns - a = (16- 8) cm = 8 cm,\ns - b = (16-11) cm = 5 cm,\ns - c = (16-13) cm = 3 cm.\nTherefore, area of the triangle = √s(s -a) (s – b) (s - c)\n= √16 × 8 × 5 ×3 cm² = 8√30 cm²\nExample 2: A triangular park ABC has sides 120m, 80m and 50m (see Fig. 10.4). A gardener Dhania has to put a fence all around it and also plant grass inside. How much area does she need to plant? Find the cost of fencing it with barbed wire at the rate of ₹ 20 per metre leaving a space 3m wide for a gate on one side.\nSolution: For finding area of the park, we have\n2s = 50 m + 80 m + 120 m = 250 m.\ni.e., s = 125 m\nNow,\ns - a = (125 – 120) m = 5 m,\ns − b = (125 – 80) m = 45 m,\ns - c = (125 – 50) m = 75 m.\nTherefore, area of the park = √s(s -a) (s – b) (s – c)\n= √125 × 5 × 45 × 75 m²\n= 375√15 m²\nAlso, perimeter of the park = AB + BC + CA = 250 m\nTherefore, length of the wire needed for fencing = 250 m – 3 m (to be left for gate) = 247 m\nAnd so the cost of fencing = ₹20 × 247 = ₹4940\nExample 3: The sides of a triangular plot are in the ratio of 3 : 5 : 7 and its perimeter is 300 m. Find its area.\nSolution: Suppose that the sides, in metres, are 3x, 5x and 7x (see Fig. 10.5).\nThen, we know that 3x + 5x + 7x = 300 (perimeter of the triangle)\nTherefore, 15x = 300, which gives x = 20.\nSo the sides of the triangle are 3 × 20 m, 5 × 20 m and 7 × 20 m\ni.e., 60 m, 100 m and 140 m.\nCan you now find the area [Using Heron's formula]?\nWe have s =\n60 + 100 + 140\n2\nm = 150 m,\nand area will be √150(150 – 60) (150 – 100) (150 – 140) m²\n= √150 × 90 × 50 × 10 m²\n= 1500√3 m²",
                    "figure_table_number": [
                        "Fig. 10.1",
                        "Fig. 10.2",
                        "Fig. 10.3",
                        "Fig. 10.4",
                        "Fig. 10.5"
                    ],
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "10",
                            "chapter_title": "HERON'S FORMULA",
                            "section_number": "10.1",
                            "section_title": "Area of a Triangle — by Heron's Formula"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ],
            "metadata": {
                "grade": "9",
                "subject": "Mathematics",
                "source": "NCERT"
            }
        },
        {
            "chapter_number": "11",
            "chapter_title": "Surface Areas and Volumes",
            "topics": [
                {
                    "topic": "Surface Area of a Right Circular Cone",
                    "content": "We have already studied the surface areas of cube, cuboid and cylinder. We will now study the surface area of cone.\nSo far, we have been generating solids by stacking up congruent figures. Incidentally, such figures are called prisms. Now let us look at another kind of solid which is not a prism (These kinds of solids are called pyramids.). Let us see how we can generate them.\nThis is called a right circular cone. In Fig. 11.1(c) of the right circular cone, the point A is called the vertex, AB is called the height, BC is called the radius and AC is called the slant height of the cone. Here B will be the centre of circular base of the cone. The height, radius and slant height of the cone are usually denoted by h, r and l respectively. Once again, let us see what kind of cone we can not call a right circular cone. Here, you are (see Fig. 11.2)! What you see in these figures are not right circular cones; because in (a), the line joining its vertex to the centre of its base is not at right angle to the base, and in (b) the base is not circular.\nAs in the case of cylinder, since we will be studying only about right circular cones, remember that by 'cone' in this chapter, we shall mean a 'right circular cone.'\nActivity: (i) Cut out a neatly made paper cone that does not have any overlapped paper, straight along its side, and opening it out, to see the shape of paper that forms the surface of the cone. (The line along which you cut the cone is the slant height of the cone which is represented by l). It looks like a part of a round cake.\n(ii) If you now bring the sides marked A and B at the tips together, you can see that the curved portion of Fig. 11.3 (c) will form the circular base of the cone.\n(iii) If the paper like the one in Fig. 11.3 (c) is now cut into hundreds of little pieces, along the lines drawn from the point O, each cut portion is almost a small triangle, whose height is the slant height l of the cone.\n(iv) Now the area of each triangle = 1/2 × base of each triangle × l.\nSo, area of the entire piece of paper = sum of the areas of all the triangles = 1/2 b₁l + 1/2 b₂l + 1/2 b₃l + ... = 1/2 l (b₁ + b₂ + b₃ + ...) = 1/2 × l × length of entire curved boundary of Fig. 11.3(c) (as b₁ + b₂ + b₃ + . . . makes up the curved portion of the figure)\nBut the curved portion of the figure makes up the perimeter of the base of the cone and the circumference of the base of the cone = 2πr, where r is the base radius of the cone.\nSo, Curved Surface Area of a Cone = 1/2 × l × 2πr = πrl\nwhere r is its base radius and l its slant height.\nNote that l² = r² + h² (as can be seen from Fig. 11.4), applying Pythagoras Theorem. Here h is the height of the cone.\nTherefore, l = √r² + h²\nNow if the base of the cone is to be closed, then a circular piece of paper of radius r is also required whose area is πr².\nSo, Total Surface Area of a Cone = πrl + πr² = πr(l + r)",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.1",
                            "section_title": "Surface Area of a Right Circular Cone",
                            "figure_table_number": "Fig. 11.1, Fig. 11.2, Fig. 11.3, Fig. 11.4"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 1",
                    "content": "Find the curved surface area of a right circular cone whose slant height is 10 cm and base radius is 7 cm.\nSolution: Curved surface area = πrl = 22/7 × 7 × 10 cm² = 220 cm²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.1",
                            "section_title": "Surface Area of a Right Circular Cone",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 2",
                    "content": "The height of a cone is 16 cm and its base radius is 12 cm. Find the curved surface area and the total surface area of the cone (Use π = 3.14).\nSolution: Here, h = 16 cm and r = 12 cm.\nSo, from l² = h² + r², we have\nl= √16² + 12² cm = 20 cm\nSo, curved surface area = πrl = 3.14 × 12 × 20 cm² = 753.6 cm²\nFurther, total surface area = πrl + πr² = (753.6 + 3.14 × 12 × 12) cm² = (753.6 + 452.16) cm² = 1205.76 cm²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.1",
                            "section_title": "Surface Area of a Right Circular Cone",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 3",
                    "content": "A corn cob (see Fig. 11.5), shaped somewhat like a cone, has the radius of its broadest end as 2.1 cm and length (height) as 20 cm. If each 1 cm² of the surface of the cob carries an average of four grains, find how many grains you would find on the entire cob.\nSolution: Since the grains of corn are found only on the curved surface of the corn cob, we would need to know the curved surface area of the corn cob to find the total number of grains on it. In this question, we are given the height of the cone, so we need to find its slant height.\nHere, l= √r² + h² = √(2.1)² + 20² cm = √404.41 cm = 20.11 cm\nTherefore, the curved surface area of the corn cob = πrl = 22/7 × 2.1 × 20.11 cm² = 132.73 cm² (approx.)\nNumber of grains of corn on 1 cm² of the surface of the corn cob = 4\nTherefore, number of grains on the entire curved surface of the cob = 132.73 × 4 = 530.92 = 531 (approx.)\nSo, there would be approximately 531 grains of corn on the cob.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.1",
                            "section_title": "Surface Area of a Right Circular Cone",
                            "figure_table_number": "Fig. 11.5"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Surface Area of a Sphere",
                    "content": "What is a sphere? Is it the same as a circle? Can you draw a circle on a paper? Yes, you can, because a circle is a plane closed figure whose every point lies at a constant distance (called radius) from a fixed point, which is called the centre of the circle.\nNow if you paste a string along a diameter of a circular disc and rotate it as you had rotated the triangle in the previous section, you see a new solid (see Fig 11.6). What does it resemble? A ball? Yes. It is called a sphere.\nCan you guess what happens to the centre of the circle, when it forms a sphere on rotation? Of course, it becomes the centre of the sphere. So, a sphere is a three dimensional figure (solid figure), which is made up of all points in the space, which lie at a constant distance called the radius, from a fixed point called the centre of the sphere.\nNote : A sphere is like the surface of a ball. The word solid sphere is used for the solid whose surface is a sphere.\nActivity: Have you ever played with a top or have you at least watched someone play with one? You must be aware of how a string is wound around it. Now, let us take a rubber ball and drive a nail into it. Taking support of the nail, let us wind a string around the ball. When you have reached the 'fullest' part of the ball, use pins to keep the string in place, and continue to wind the string around the remaining part of the ball, till you have completely covered the ball [see Fig. 11.7(a)]. Mark the starting and finishing points on the string, and slowly unwind the string from the surface of the ball.\nNow, ask your teacher to help you in measuring the diameter of the ball, from which you easily get its radius. Then on a sheet of paper, draw four circles with radius equal to the radius of the ball. Start filling the circles one by one, with the string you had wound around the ball [see Fig. 11.7(b)].\nWhat have you achieved in all this?\nThe string, which had completely covered the surface area of the sphere, has been used to completely fill the regions of four circles, all of the same radius as of the sphere.\nSo, what does that mean? This suggests that the surface area of a sphere of radius r = 4 times the area of a circle of radius r = 4 × (πr²)\nSo, Surface Area of a Sphere = 4 πr²\nwhere r is the radius of the sphere.\nHow many faces do you see in the surface of a sphere? There is only one, which is curved.\nNow, let us take a solid sphere, and slice it exactly 'through the middle' with a plane that passes through its centre. What happens to the sphere?\nYes, it gets divided into two equal parts (see Fig. 11.8)! What will each half be called? It is called a hemisphere. (Because 'hemi' also means 'half')\nAnd what about the surface of a hemisphere? How many faces does it have?\nTwo! There is a curved face and a flat face (base).\nThe curved surface area of a hemisphere is half the surface area of the sphere, which is 1/2 of 4πr².\nTherefore, Curved Surface Area of a Hemisphere = 2πr²\nwhere r is the radius of the sphere of which the hemisphere is a part.\nNow taking the two faces of a hemisphere, its surface area 2πr² + πr²\nSo, Total Surface Area of a Hemisphere = 3πr²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.2",
                            "section_title": "Surface Area of a Sphere",
                            "figure_table_number": "Fig. 11.6, Fig. 11.7, Fig. 11.8"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 4",
                    "content": "Find the surface area of a sphere of radius 7 cm.\nSolution: The surface area of a sphere of radius 7 cm would be\n4πr² = 4 × 22/7 × 7 × 7 cm² = 616 cm²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.2",
                            "section_title": "Surface Area of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 5",
                    "content": "Find (i) the curved surface area and (ii) the total surface area of a hemisphere of radius 21 cm.\nSolution: The curved surface area of a hemisphere of radius 21 cm would be\n= 2πr² = 2 × 22/7 × 21 × 21 cm² = 2772 cm²\n(ii) the total surface area of the hemisphere would be\n3πr² = 3 × 22/7 × 21 × 21 cm² = 4158 cm²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.2",
                            "section_title": "Surface Area of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 6",
                    "content": "The hollow sphere, in which the circus motorcyclist performs his stunts, has a diameter of 7 m. Find the area available to the motorcyclist for riding.\nSolution: Diameter of the sphere = 7 m. Therefore, radius is 3.5 m. So, the riding space available for the motorcyclist is the surface area of the 'sphere' which is given by\n4πr² = 4 × 22/7 × 3.5 × 3.5 m² = 154 m²",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.2",
                            "section_title": "Surface Area of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 7",
                    "content": "A hemispherical dome of a building needs to be painted (see Fig. 11.9). If the circumference of the base of the dome is 17.6 m, find the cost of painting it, given the cost of painting is ₹ 5 per 100 cm².\nSolution: Since only the rounded surface of the dome is to be painted, we would need to find the curved surface area of the hemisphere to know the extent of painting that needs to be done. Now, circumference of the dome = 17.6 m. Therefore, 17.6 = 2πr.\nSo, the radius of the dome = 17.6 × 7 / (2 × 22) m = 2.8 m\nThe curved surface area of the dome = 2πr²\n= 2 × 22/7 × 2.8 × 2.8 m² = 49.28 m²\nNow, cost of painting 100 cm² is ₹ 5.\nSo, cost of painting 1 m² = ₹ 500\nTherefore, cost of painting the whole dome = ₹ 500 × 49.28 = ₹ 24640",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.2",
                            "section_title": "Surface Area of a Sphere",
                            "figure_table_number": "Fig. 11.9"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Volume of a Right Circular Cone",
                    "content": "In earlier classes we have studied the volumes of cube, cuboid and cylinder\nIn Fig 11.11, can you see that there is a right circular cylinder and a right circular cone of the same base radius and the same height?\nActivity : Try to make a hollow cylinder and a hollow cone like this with the same base radius and the same height (see Fig. 11.11). Then, we can try out an experiment that will help us, to see practically what the volume of a right circular cone would be!\nSo, let us start like this.\nFill the cone up to the brim with sand once, and empty it into the cylinder. We find that it fills up only a part of the cylinder [see Fig. 11.12(a)].\nWhen we fill up the cone again to the brim, and empty it into the cylinder, we see that the cylinder is still not full [see Fig. 11.12(b)].\nWhen the cone is filled up for the third time, and emptied into the cylinder, it can be seen that the cylinder is also full to the brim [see Fig. 11.12(c)].\nWith this, we can safely come to the conclusion that three times the volume of a cone, makes up the volume of a cylinder, which has the same base radius and the same height as the cone, which means that the volume of the cone is one-third the volume of the cylinder.\nSo, Volume of a Cone = 1/3 πr²h\nwhere r is the base radius and h is the height of the cone.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.3",
                            "section_title": "Volume of a Right Circular Cone",
                            "figure_table_number": "Fig. 11.10, Fig. 11.11, Fig. 11.12"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 8",
                    "content": "The height and the slant height of a cone are 21 cm and 28 cm respectively. Find the volume of the cone.\nSolution: From l² = r² + h², we have\nr = √l² - h² = √28² - 21² cm = 7√7 cm\nSo, volume of the cone = 1/3 πr²h = 1/3 × 22/7 × 7√7 × 7√7 × 21 cm³ = 7546 cm³",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.3",
                            "section_title": "Volume of a Right Circular Cone",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 9",
                    "content": "Monica has a piece of canvas whose area is 551 m². She uses it to have a conical tent made, with a base radius of 7 m. Assuming that all the stitching margins and the wastage incurred while cutting, amounts to approximately 1 m², find the volume of the tent that can be made with it.\nSolution: Since the area of the canvas = 551 m² and area of the canvas lost in wastage is 1 m², therefore the area of canvas available for making the tent is (551 – 1) m² = 550 m².\nNow, the surface area of the tent = 550 m² and the required base radius of the conical tent = 7 m\nNote that a tent has only a curved surface (the floor of a tent is not covered by canvas!!).\nTherefore, curved surface area of tent = 550 m².\nThat is, πrl = 550\n22/7 × 7 × l = 550\nor, l = 550 × 7/22 = 25 m\nNow,\nh = √l² - r² = √25² - 7² m = √625 – 49 m = √576 m = 24 m\nSo, the volume of the conical tent = 1/3 πr²h = 1/3 × 22/7 × 7 × 7 × 24 m³ = 1232 m³.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.3",
                            "section_title": "Volume of a Right Circular Cone",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Volume of a Sphere",
                    "content": "Now, let us see how to go about measuring the volume of a sphere. First, take two or three spheres of different radii, and a container big enough to be able to put each of the spheres into it, one at a time. Also, take a large trough in which you can place the container. Then, fill the container up to the brim with water [see Fig. 11.13(a)].\nNow, carefully place one of the spheres in the container. Some of the water from the container will over flow into the trough in which it is kept [see Fig. 11.13(b)].\nCarefully pour out the water from the trough into a measuring cylinder (i.e., a graduated cylindrical jar) and measure the water over flowed [see Fig. 11.13(c)]. Suppose the radius of the immersed sphere is r (you can find the radius by measuring the diameter of the sphere). Then evaluate 4/3 πr³. Do you find this value almost equal to the measure of the volume over flowed?\nOnce again repeat the procedure done just now, with a different size of sphere. Find the radius R of this sphere and then calculate the value of 4/3 πR³. Once again this value is nearly equal to the measure of the volume of the water displaced (over flowed) by the sphere. What does this tell us? We know that the volume of the sphere is the same as the measure of the volume of the water displaced by it. By doing this experiment repeatedly with spheres of varying radii, we are getting the same result, namely, the volume of a sphere is equal to 4/3 π times the cube of its radius. This gives us the idea that\nVolume of a Sphere = 4/3 πr³\nwhere r is the radius of the sphere.\nLater, in higher classes it can be proved also. But at this stage, we will just take it as true.\nSince a hemisphere is half of a sphere, can you guess what the volume of a hemisphere will be? Yes, it is 1/2 of 4/3 πr³ = 2/3 πr³.\nSo, Volume of a Hemisphere = 2/3 πr³\nwhere r is the radius of the hemisphere.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.4",
                            "section_title": "Volume of a Sphere",
                            "figure_table_number": "Fig. 11.13"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 10",
                    "content": "Find the volume of a sphere of radius 11.2 cm.\nSolution: Required volume = 4/3 πr³ = 4/3 × 22/7 × 11.2 × 11.2 × 11.2 cm³ = 5887.32 cm³",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.4",
                            "section_title": "Volume of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 11",
                    "content": "A shot-putt is a metallic sphere of radius 4.9 cm. If the density of the metal is 7.8 g per cm³, find the mass of the shot-putt.\nSolution: Since the shot-putt is a solid sphere made of metal and its mass is equal to the product of its volume and density, we need to find the volume of the sphere.\nNow, volume of the sphere = 4/3 πr³ = 4/3 × 22/7 × 4.9 × 4.9 × 4.9 cm³ = 493 cm³ (nearly)\nFurther, mass of 1 cm³ of metal is 7.8 g.\nTherefore, mass of the shot-putt = 7.8 × 493 g = 3845.44 g = 3.85 kg (nearly)",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.4",
                            "section_title": "Volume of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 12",
                    "content": "A hemispherical bowl has a radius of 3.5 cm. What would be the volume of water it would contain?\nSolution: The volume of water the bowl can contain = 2/3 πr³ = 2/3 × 22/7 × 3.5 × 3.5 × 3.5 cm³ = 89.8 cm³",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "11",
                            "chapter_title": "Surface Areas and Volumes",
                            "section_number": "11.4",
                            "section_title": "Volume of a Sphere",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "12",
            "chapter_title": "STATISTICS",
            "topics": [
                {
                    "topic": "Graphical Representation of Data",
                    "content": "The representation of data by tables has already been discussed. Now let us turn our attention to another representation of data, i.e., the graphical representation. It is well said that one picture is better than a thousand words. Usually comparisons among the individual items are best shown by means of graphs. The representation then becomes easier to understand than the actual data. We shall study the following graphical representations in this section.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Bar Graphs",
                    "content": "In earlier classes, you have already studied and constructed bar graphs. Here we shall discuss them through a more formal approach. Recall that a bar graph is a pictorial representation of data in which usually bars of uniform width are drawn with equal spacing between them on one axis (say, the x-axis), depicting the variable. The values of the variable are shown on the other axis (say, the y-axis) and the heights of the bars depend on the values of the variable.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Fig. 12.1"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 2: Drawing a Bar Graph",
                    "content": "A family with a monthly income of ₹20,000 had planned the following expenditures per month under various heads:\nTable 12.1\nHeads\nExpenditure\n(in thousand rupees)\nGrocery\n4\nRent\n5\nEducation of children\n5\nMedicine\n2\nFuel\n2\nEntertainment\n1\nMiscellaneous\n1\nWe draw the bar graph of this data in the following steps. Note that the unit in the second column is thousand rupees. So, '4' against 'grocery' means ₹4000.\n1. We represent the Heads (variable) on the horizontal axis choosing any scale, since the width of the bar is not important. But for clarity, we take equal widths for all bars and maintain equal gaps in between. Let one Head be represented by one unit.\n2. We represent the expenditure (value) on the vertical axis. Since the maximum expenditure is ₹5000, we can choose the scale as 1 unit = ₹1000.\n3. To represent our first Head, i.e., grocery, we draw a rectangular bar with width 1 unit and height 4 units.\n4. Similarly, other Heads are represented leaving a gap of 1 unit in between two consecutive bars.\nThe bar graph is drawn in Fig. 12.2.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Table 12.1, Fig. 12.2"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Histogram",
                    "content": "This is a form of representation like the bar graph, but it is used for continuous class intervals. For instance, consider the frequency distribution Table 12.2, representing the weights of 36 students of a class:\nTable 12.2\nWeights (in kg)\nNumber of students\n30.5-35.5\n9\n35.5-40.5\n6\n40.5 - 45.5\n15\n45.5 - 50.5\n3\n50.5 -55.5\n1\n55.5 - 60.5\n2\nTotal\n36\nLet us represent the data given above graphically as follows:\n(i) We represent the weights on the horizontal axis on a suitable scale. We can choose the scale as 1 cm = 5 kg. Also, since the first class interval is starting from 30.5 and not zero, we show it on the graph by marking a kink or a break on the axis.\n(ii) We represent the number of students (frequency) on the vertical axis on a suitable scale. Since the maximum frequency is 15, we need to choose the scale to accomodate this maximum frequency.\n(iii) We now draw rectangles (or rectangular bars) of width equal to the class-size and lengths according to the frequencies of the corresponding class intervals. For example, the rectangle for the class interval 30.5 - 35.5 will be of width 1 cm and length 4.5 cm.\n(iv) In this way, we obtain the graph as shown in Fig. 12.3:\nObserve that since there are no gaps in between consecutive rectangles, the resultant graph appears like a solid figure. This is called a histogram, which is a graphical representation of a grouped frequency distribution with continuous classes. Also, unlike a bar graph, the width of the bar plays a significant role in its construction.\nHere, in fact, areas of the rectangles erected are proportional to the corresponding frequencies. However, since the widths of the rectangles are all equal, the lengths of the rectangles are proportional to the frequencies. That is why, we draw the lengths according to (iii) above.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Table 12.2, Fig. 12.3"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 3: Histogram with Varying Class Widths",
                    "content": "A teacher wanted to analyse the performance of two sections of students in a mathematics test of 100 marks. Looking at their performances, she found that a few students got under 20 marks and a few got 70 marks or above. So she decided to group them into intervals of varying sizes as follows: 0 - 20, 20 - 30, . . ., 60 - 70, 70 - 100. Then she formed the following table:\nTable 12.3\nMarks\nNumber of students\n0-20\n7\n20-30\n10\n30-40\n10\n40-50\n20\n50-60\n20\n60-70\n15\n70 - above\n8\nTotal\n90\nA histogram for this table was prepared by a student as shown in Fig. 12.4.\nCarefully examine this graphical representation. Do you think that it correctly represents the data? No, the graph is giving us a misleading picture. As we have mentioned earlier, the areas of the rectangles are proportional to the frequencies in a histogram. Earlier this problem did not arise, because the widths of all the rectangles were equal. But here, since the widths of the rectangles are varying, the histogram above does not give a correct picture. For example, it shows a greater frequency in the interval 70 - 100, than in 60 - 70, which is not the case.\nSo, we need to make certain modifications in the lengths of the rectangles so that the areas are again proportional to the frequencies.\nThe steps to be followed are as given below:\n1. Select a class interval with the minimum class size. In the example above, the minimum class-size is 10.\n2. The lengths of the rectangles are then modified to be proportionate to the class-size 10.\nFor instance, when the class-size is 20, the length of the rectangle is 7. So when the class-size is 10, the length of the rectangle will be 7/20 * 10 = 3.5.\nSimilarly, proceeding in this manner, we get the following table:\nTable 12.4\nMarks\nFrequency\nWidth of\nthe class\nLength of the rectangle\n0-20\n7\n20\n7/20 * 10 = 3.5\n20-30\n10\n10\n10/10 * 10 = 10\n30-40\n10\n10\n10/10 * 10 = 10\n40-50\n20\n10\n20/10 * 10 = 20\n50-60\n20\n10\n20/10 * 10 = 20\n60-70\n15\n10\n15/10 * 10 = 15\n70-100\n8\n30\n8/30 * 10 = 2.67\nSince we have calculated these lengths for an interval of 10 marks in each case, we may call these lengths as “proportion of students per 10 marks interval”.\nSo, the correct histogram with varying width is given in Fig. 12.5.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Table 12.3, Fig. 12.4, Table 12.4, Fig. 12.5"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Frequency Polygon",
                    "content": "There is yet another visual way of representing quantitative data and its frequencies. This is a polygon. To see what we mean, consider the histogram represented by Fig. 12.3. Let us join the mid-points of the upper sides of the adjacent rectangles of this histogram by means of line segments. Let us call these mid-points B, C, D, E, F and G. When joined by line segments, we obtain the figure BCDEFG (see Fig. 12.6).\nTo complete the polygon, we assume that there is a class interval with frequency zero before 30.5 - 35.5, and one after 55.5 - 60.5, and their mid-points are A and H, respectively. ABCDEFGH is the frequency polygon corresponding to the data shown in Fig. 12.3. We have shown this in Fig. 12.6.\nAlthough, there exists no class preceding the lowest class and no class succeeding the highest class, addition of the two class intervals with zero frequency enables us to make the area of the frequency polygon the same as the area of the histogram. Why is this so? (Hint : Use the properties of congruent triangles.)\nNow, the question arises: how do we complete the polygon when there is no class preceding the first class? Let us consider such a situation.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Fig. 12.6"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Example 4: Drawing a Frequency Polygon",
                    "content": "Consider the marks, out of 100, obtained by 51 students of a class in a test, given in Table 12.5.\nTable 12.5\nMarks\nNumber of students\n0-10\n5\n10-20\n10\n20-30\n4\n30-40\n6\n40-50\n7\n50-60\n3\n60-70\n2\n70-80\n2\n80-90\n3\n90-100\nTotal\n51\nDraw a frequency polygon corresponding to this frequency distribution table.\nSolution: Let us first draw a histogram for this data and mark the mid-points of the tops of the rectangles as B, C, D, E, F, G, H, I, J, K, respectively. Here, the first class is 0-10. So, to find the class preceeding 0-10, we extend the horizontal axis in the negative direction and find the mid-point of the imaginary class-interval (-10) - 0. The first end point, i.e., B is joined to this mid-point with zero frequency on the negative direction of the horizontal axis. The point where this line segment meets the vertical axis is marked as A. Let L be the mid-point of the class succeeding the last class of the given data. Then OABCDEFGHIJKL is the frequency polygon, which is shown in Fig. 12.7.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Table 12.5, Fig. 12.7"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Drawing Frequency Polygons Independently",
                    "content": "Frequency polygons can also be drawn independently without drawing histograms. For this, we require the mid-points of the class-intervals used in the data. These mid-points of the class-intervals are called class-marks.\nTo find the class-mark of a class interval, we find the sum of the upper limit and lower limit of a class and divide it by 2. Thus,\nClass-mark = (Upper limit + Lower limit) / 2\nLet us consider an example.\nExample 5: In a city, the weekly observations made in a study on the cost of living index are given in the following table:\nTable 12.6\nCost of living index\nNumber of weeks\n140-150\n5\n150-160\n10\n160-170\n20\n170-180\n9\n180-190\n6\n190 - 200\n2\nTotal\n52\nDraw a frequency polygon for the data above (without constructing a histogram).\nSolution: Since we want to draw a frequency polygon without a histogram, let us find the class-marks of the classes given above, that is of 140 - 150, 150 - 160,....\nFor 140 - 150, the upper limit = 150, and the lower limit = 140\nSo, the class-mark = (150 + 140) / 2 = 290 / 2 = 145.\nContinuing in the same manner, we find the class-marks of the other classes as well. So, the new table obtained is as shown in the following table:\nTable 12.7\nClasses\nClass-marks\nFrequency\n140-150\n145\n5\n150-160\n155\n10\n160-170\n165\n20\n170-180\n175\n9\n180-190\n185\n6\n190 - 200\n195\n2\nTotal\n52\nWe can now draw a frequency polygon by plotting the class-marks along the horizontal axis, the frequencies along the vertical-axis, and then plotting and joining the points B(145, 5), C(155, 10), D(165, 20), E(175, 9), F(185, 6) and G(195, 2) by line segments.\nWe should not forget to plot the point corresponding to the class-mark of the class 130 - 140 (just before the lowest class 140 - 150) with zero frequency, that is, A(135, 0), and the point H (205, 0) occurs immediately after G(195, 2). So, the resultant frequency polygon will be ABCDEFGH (see Fig. 12.8).",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "12",
                            "chapter_title": "STATISTICS",
                            "section_number": "12.1",
                            "section_title": "Graphical Representation of Data",
                            "figure_table_number": "Table 12.6, Table 12.7, Fig. 12.8"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "Appendix 1",
            "chapter_title": "Proofs in Mathematics",
            "topics": [
                {
                    "topic": "Introduction",
                    "content": "In our daily life, we are often called upon to prove that a certain statement or claim is true or false. However, we also accept many statements without bothering to prove them. But, in mathematics we only accept a statement as true or false (except for some axioms) if it has been proved to be so, according to the logic of mathematics.\nIn fact, proofs in mathematics have been in existence for thousands of years, and they are central to any branch of mathematics. The first known proof is believed to have been given by the Greek philosopher and mathematician Thales. While mathematics was central to many ancient civilisations like Mesopotamia, Egypt, China and India, there is no clear evidence that they used proofs the way we do today.\nIn this chapter, we will look at what a statement is, what kind of reasoning is involved in mathematics, and what a mathematical proof consists of.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.1",
                            "section_title": "Introduction",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Mathematically Acceptable Statements",
                    "content": "In this section, we shall try to explain the meaning of a mathematically acceptable statement. A 'statement' is a sentence which is not an order or an exclamatory sentence. And, of course, a statement is not a question! For example,\n\"What is the colour of your hair?” is not a statement, it is a question.\n\"Please go and bring me some water.” is a request or an order, not a statement.\n“What a marvellous sunset!” is an exclamatory remark, not a statement.\nHowever, “The colour of your hair is black” is a statement.\nIn general, statements can be one of the following:\n• always true\n• always false\n• ambiguous\nThe word 'ambiguous' needs some explanation. There are two situations which make a statement ambiguous. The first situation is when we cannot decide if the statement is always true or always false. For example, “Tomorrow is Thursday\" is ambiguous, since enough of a context is not given to us to decide if the statement is true or false.\nThe second situation leading to ambiguity is when the statement is subjective, that is, it is true for some people and not true for others. For example, \"Dogs are intelligent\" is ambiguous because some people believe this is true and others do not.\nExample 1: State whether the following statements are always true, always false or ambiguous. Justify your answers.\n(i) There are 8 days in a week.\n(ii) It is raining here.\n(iii) The sun sets in the west.\n(iv) Gauri is a kind girl.\n(v) The product of two odd integers is even.\n(vi) The product of two even natural numbers is even.\nSolution :\n(i) This statement is always false, since there are 7 days in a week.\n(ii) This statement is ambiguous, since it is not clear where ‘here' is.\n(iii) This statement is always true. The sun sets in the west no matter where we live.\n(iv) This statement is ambiguous, since it is subjective-Gauri may be kind to some and not to others.\n(v) This statement is always false. The product of two odd integers is always odd.\n(vi) This statement is always true. However, to justify that it is true we need to do some work. It will be proved in Section A1.4.\nAs mentioned before, in our daily life, we are not so careful about the validity of statements. For example, suppose your friend tells you that in July it rains everyday in Manantavadi, Kerala. In all probability, you will believe her, even though it may not have rained for a day or two in July. Unless you are a lawyer, you will not argue with her!\nAs another example, consider statements we often make to each other like “it is very hot today\". We easily accept such statements because we know the context even though these statements are ambiguous. 'It is very hot today' can mean different things to different people because what is very hot for a person from Kumaon may not be hot for a person from Chennai.\nBut a mathematical statement cannot be ambiguous. In mathematics, a statement is only acceptable or valid, if it is either true or false. We say that a statement is true, if it is always true otherwise it is called a false statement.\nFor example, 5 + 2 = 7 is always true, so ‘5 + 2 = 7' is a true statement and 5 + 3 = 7 is a false statement.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.2",
                            "section_title": "Mathematically Acceptable Statements",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Examples for Mathematically Acceptable Statements",
                    "content": "Example 2: State whether the following statements are true or false:\n(i) The sum of the interior angles of a triangle is 180°.\n(ii) Every odd number greater than 1 is prime.\n(iii) For any real number x, 4x + x = 5x.\n(iv) For every real number x, 2x > x.\n(v) For every real number x, x² ≥ x.\n(vi) If a quadrilateral has all its sides equal, then it is a square.\nSolution :\n(i) This statement is true. You have already proved this in Chapter 6.\n(ii) This statement is false; for example, 9 is not a prime number.\n(iii) This statement is true.\n(iv) This statement is false; for example, 2 × (-1) = -2, and – 2 is not greater than -1.\n(v) This statement is false; for example, (1/2)² = 1/4, and 1/4 is not greater than 1/2.\n(vi) This statement is false, since a rhombus has equal sides but need not be a square.\nYou might have noticed that to establish that a statement is not true according to mathematics, all we need to do is to find one case or example where it breaks down. So in (ii), since 9 is not a prime, it is an example that shows that the statement “Every odd number greater than 1 is prime” is not true. Such an example, that counters a statement, is called a counter-example. We shall discuss counter-examples in greater detail in Section A1.5.\nYou might have also noticed that while Statements (iv), (v) and (vi) are false, they can be restated with some conditions in order to make them true.\nExample 3: Restate the following statements with appropriate conditions, so that they become true statements.\n(i) For every real number x, 2x > x.\n(ii) For every real number x, x² > x.\n(iii) If you divide a number by itself, you will always get 1.\n(iv) The angle subtended by a chord of a circle at a point on the circle is 90°.\n(v) If a quadrilateral has all its sides equal, then it is a square.\nSolution :\n(i) If x > 0, then 2x > x.\n(ii) If x ≤ 0 or x ≥ 1, then x² ≥ x.\n(iii) If you divide a number except zero by itself, you will always get 1.\n(iv) The angle subtended by a diameter of a circle at a point on the circle is 90°.\n(v) If a quadrilateral has all its sides and interior angles equal, then it is a square.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.2",
                            "section_title": "Mathematically Acceptable Statements",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Deductive Reasoning",
                    "content": "The main logical tool used in establishing the truth of an unambiguous statement is deductive reasoning. To understand what deductive reasoning is all about, let us begin with a puzzle for you to solve.\nYou are given four cards. Each card has a number printed on one side and a letter on the other side.\nA V 6 5\nSuppose you are told that these cards follow the rule:\n\"If a card has an even number on one side, then it has a vowel on the other side.\"\nWhat is the smallest number of cards you need to turn over to check if the rule is true?\nOf course, you have the option of turning over all the cards and checking. But can you manage with turning over a fewer number of cards?\nNotice that the statement mentions that a card with an even number on one side has a vowel on the other. It does not state that a card with a vowel on one side must have an even number on the other side. That may or may not be so. The rule also does not state that a card with an odd number on one side must have a consonant on the other side. It may or may not.\nSo, do we need to turn over ‘A’? No! Whether there is an even number or an odd number on the other side, the rule still holds.\nWhat about '5'? Again we do not need to turn it over, because whether there is a vowel or a consonant on the other side, the rule still holds.\nBut you do need to turn over V and 6. If V has an even number on the other side, then the rule has been broken. Similarly, if 6 has a consonant on the other side, then the rule has been broken.\nThe kind of reasoning we have used to solve this puzzle is called deductive reasoning. It is called 'deductive' because we arrive at (i.e., deduce or infer) a result or a statement from a previously established statement using logic. For example, in the puzzle above, by a series of logical arguments we deduced that we need to turn over only V and 6.\nDeductive reasoning also helps us to conclude that a particular statement is true, because it is a special case of a more general statement that is known to be true. For example, once we prove that the product of two odd numbers is always odd, we can immediately conclude (without computation) that 70001 × 134563 is odd simply because 70001 and 134563 are odd.\nDeductive reasoning has been a part of human thinking for centuries, and is used all the time in our daily life. For example, suppose the statements \"The flower Solaris blooms, only if the maximum temperature is above 28° C on the previous day\" and \"Solaris bloomed in Imaginary Valley on 15th September, 2005\" are true. Then using deductive reasoning, we can conclude that the maximum temperature in Imaginary Valley on 14th September, 2005 was more than 28° C.\nUnfortunately we do not always use correct reasoning in our daily life! We often come to many conclusions based on faulty reasoning. For example, if your friend does not smile at you one day, then you may conclude that she is angry with you. While it may be true that “if she is angry with me, she will not smile at me\", it may also be true that \"if she has a bad headache, she will not smile at me”. Why don't you examine your day-to-day existence, and see if some conclusions that you have arrived at are based on valid or faulty reasoning?",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.3",
                            "section_title": "Deductive Reasoning",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Theorems, Conjectures and Axioms",
                    "content": "So far we have discussed statements and how to check their validity. In this section, you will study how to distinguish between the three different kinds of statements mathematics is built up from, namely, a theorem, a conjecture and an axiom.\nYou have already come across many theorems before. So, what is a theorem? A mathematical statement whose truth has been established (proved) is called a theorem. For example, the following statements are theorems, as you will see in Section A1.5.\nTheorem A1.1: The sum of the interior angles of a triangle is 180°.\nTheorem A1.2: The product of two even natural numbers is even.\nTheorem A1.3: The product of any three consecutive even natural numbers is divisible by 16.\nA conjecture is a statement which we believe is true, based on our mathematical understanding and experience, that is, our mathematical intuition. The conjecture may turn out to be true or false. If we can prove it, then it becomes a theorem.\nMathematicians often come up with conjectures by looking for patterns and making intelligent mathematical guesses. Let us look at some patterns and see what kind of intelligent guesses we can make.\nExample 4: Take any three consecutive even numbers and add them, say, 2 + 4 + 6 = 12, 4 + 6 + 8 = 18, 6 + 8 + 10 = 24, 8 + 10 + 12 = 30, 20 + 22 + 24 = 66.\nIs there any pattern you can guess in these sums? What can you conjecture about them?\nSolution: One conjecture could be :\n(i) the sum of three consecutive even numbers is even.\nAnother could be :\n(ii) the sum of three consecutive even numbers is divisible by 6.\nExample 5: Consider the following pattern of numbers called the Pascal's Triangle:\nLine | Sum of numbers\n1 | 1\n2 | 2\n3 | 4\n4 | 8\n5 | 16\n6 | 32\n7 | :\n8 | :\nWhat can you conjecture about the sum of the numbers in Lines 7 and 8? What about the sum of the numbers in Line 21? Do you see a pattern? Make a guess about a formula for the sum of the numbers in line n.\nSolution: Sum of the numbers in Line 7 = 2 × 32 = 64 = 26\nSum of the numbers in Line 8 = 2 × 64 = 128 = 27\nSum of the numbers in Line 21 = 220\nSum of the numbers in Line n = 2n-1\nExample 6: Consider the so-called triangular numbers T.\nThe dots here are arranged in such a way that they form a triangle. Here T₁ = 1, T₂ = 3, T₃ = 6, T₄ = 10, and so on. Can you guess what T, is? What about T? What about T?\nn\nMake a conjecture about T.\nIt might help if you redraw them in the following way.\nSolution: T₅ = 1 + 2 + 3 + 4 + 5 = 15 = 5 × 6 / 2\nT₆ = 1 + 2 + 3 + 4 + 5 + 6 = 21 = 6 × 7 / 2\nT = n × (n + 1) / 2\nn\nA favourite example of a conjecture that has been open (that is, it has not been proved to be true or false) is the Goldbach conjecture named after the mathematician Christian Goldbach (1690 – 1764). This conjecture states that “every even integer greater than 4 can be expressed as the sum of two odd primes.\" Perhaps you will prove that this result is either true or false, and will become famous!\nYou might have wondered – do we need to prove everything we encounter in mathematics, and if not, why not?",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.4",
                            "section_title": "Theorems, Conjectures and Axioms",
                            "figure_table_number": "Fig. A1.1, Fig. A1.2"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "Axioms",
                    "content": "The fact is that every area in mathematics is based on some statements which are assumed to be true and are not proved. These are ‘self-evident truths' which we take to be true without proof. These statements are called axioms. In Chapter 5, you would have studied the axioms and postulates of Euclid. (We do not distinguish between axioms and postulates these days.)\nFor example, the first postulate of Euclid states:\nA straight line may be drawn from any point to any other point.\nAnd the third postulate states:\nA circle may be drawn with any centre and any radius.\nThese statements appear to be perfectly true and Euclid assumed them to be true. Why? This is because we cannot prove everything and we need to start somewhere. We need some statements which we accept as true and then we can build up our knowledge using the rules of logic based on these axioms.\nYou might then wonder why we don't just accept all statements to be true when they appear self-evident. There are many reasons for this. Very often our intuition can be wrong, pictures or patterns can deceive and the only way to be sure that something is true is to prove it. For example, many of us believe that if a number is multiplied by another, the result will be larger than both the numbers. But we know that this is not always true: for example, 5 × 0.2 = 1, which is less than 5.\nAlso, look at the Fig. A1.3. Which line segment is longer, AB or CD?\nIt turns out that both are of exactly the same length, even though AB appears shorter!\nYou might wonder then, about the validity of axioms. Axioms have been chosen based on our intuition and what appears to be self-evident. Therefore, we expect them to be true. However, it is possible that later on we discover that a particular axiom is not true. What is a safeguard against this possibility? We take the following steps:\n(i) Keep the axioms to the bare minimum. For instance, based on only axioms and five postulates of Euclid, we can derive hundreds of theorems.\n(ii) Make sure the axioms are consistent.\nWe say a collection of axioms is inconsistent, if we can use one axiom to show that another axiom is not true. For example, consider the following two statements. We will show that they are inconsistent.\nStatement1: No whole number is equal to its successor.\nStatement 2: A whole number divided by zero is a whole number.\n(Remember, division by zero is not defined. But just for the moment, we assume that it is possible, and see what happens.)\nFrom Statement 2, we get 1/0 = a, where a is some whole number. This implies that, 1 = 0. But this disproves Statement 1, which states that no whole number is equal to its successor.\n(iii) A false axiom will, sooner or later, result in a contradiction. We say that there is a contradiction, when we find a statement such that, both the statement and its negation are true. For example, consider Statement 1 and Statement 2 above once again.\nFrom Statement 1, we can derive the result that 2 ≠ 1.\nNow look at x² – x². We will factorise it in two different ways as follows:\n(i) x² - x² = x(x – x) and\n(ii) x² − x² = (x + x)(x – x)\nSo, x(x – x) = (x + x)(x – x).\nFrom Statement 2, we can cancel (x – x) from both sides.\nWe get x = 2x, which in turn implies 2 = 1.\nSo we have both the statement 2 ≠ 1 and its negation, 2 = 1, true. This is a contradiction. The contradiction arose because of the false axiom, that a whole number divided by zero is a whole number.\nSo, the statements we choose as axioms require a lot of thought and insight. We must make sure they do not lead to inconsistencies or logical contradictions. Moreover, the choice of axioms themselves, sometimes leads us to new discoveries. From Chapter 5, you are familiar with Euclid's fifth postulate and the discoveries of non-Euclidean geometries. You saw that mathematicians believed that the fifth postulate need not be a postulate and is actually a theorem that can be proved using just the first four postulates. Amazingly these attempts led to the discovery of non-Euclidean geometries.\nWe end the section by recalling the differences between an axiom, a theorem and a conjecture. An axiom is a mathematical statement which is assumed to be true without proof; a conjecture is a mathematical statement whose truth or falsity is yet to be established; and a theorem is a mathematical statement whose truth has been logically established.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.4",
                            "section_title": "Theorems, Conjectures and Axioms",
                            "figure_table_number": "Fig. A1.3"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "What is a Mathematical Proof?",
                    "content": "Let us now look at various aspects of proofs. We start with understanding the difference between verification and proof. Before you studied proofs in mathematics, you were mainly asked to verify statements.\nFor example, you might have been asked to verify with examples that \"the product of two even numbers is even\". So you might have picked up two random even numbers, say 24 and 2006, and checked that 24 × 2006 = 48144 is even. You might have done so for many more examples.\nAlso, you might have been asked as an activity to draw several triangles in the class and compute the sum of their interior angles. Apart from errors due to measurement, you would have found that the interior angles of a triangle add up to 180°.\nWhat is the flaw in this method? There are several problems with the process of verification. While it may help you to make a statement you believe is true, you cannot be sure that it is true in all cases. For example, the multiplication of several pairs of even numbers may lead us to guess that the product of two even numbers is even. However, it does not ensure that the product of all pairs of even numbers is even. You cannot physically check the products of all possible pairs of even numbers. If you did, then like the girl in the cartoon, you will be calculating the products of even numbers for the rest of your life. Similarly, there may be some triangles which you have not yet drawn whose interior angles do not add up to 180°. We cannot measure the interior angles of all possible triangles.\nMoreover, verification can often be misleading. For example, we might be tempted to conclude from Pascal's triangle (Q.2 of Exercise A1.3), based on earlier verifications, that 115 = 15101051. But in fact 115 =161051.\nSo, you need another approach that does not depend upon verification for some cases only. There is another approach, namely 'proving a statement'. A process which can establish the truth of a mathematical statement based purely on logical arguments is called a mathematical proof.\nIn Example 2 of Section A1.2, you saw that to establish that a mathematical statement is false, it is enough to produce a single counter-example. So while it is not enough to establish the validity of a mathematical statement by checking or verifying it for thousands of cases, it is enough to produce one counter-example to disprove a statement (i.e., to show that something is false). This point is worth emphasising.\nTo show that a mathematical statement is false, it is enough to find a single counter-example.\nSo, 7 + 5 = 12 is a counter-example to the statement that the sum of two odd numbers is odd.\nLet us now look at the list of basic ingredients in a proof:\n(i) To prove a theorem, we should have a rough idea as to how to proceed.\n(ii) The information already given to us in a theorem (i.e., the hypothesis) has to be clearly understood and used.\nFor example, in Theorem A1.2, which states that the product of two even numbers is even, we are given two even natural numbers. So, we should use their properties. In the Factor Theorem (in Chapter 2), you are given a polynomial p(x) and are told that p(a) = 0. You have to use this to show that (x – a) is a factor of p(x). Similarly, for the converse of the Factor Theorem, you are given that (x – a) is a factor of p(x), and you have to use this hypothesis to prove that p(a) =0.\nYou can also use constructions during the process of proving a theorem. For example, to prove that the sum of the angles of a triangle is 180°, we draw a line parallel to one of the sides through the vertex opposite to the side, and use properties of parallel lines.\n(iii) A proof is made up of a successive sequence of mathematical statements. Each statement in a proof is logically deduced from a previous statement in the proof, or from a theorem proved earlier, or an axiom, or our hypothesis.\n(iv) The conclusion of a sequence of mathematically true statements laid out in a logically correct order should be what we wanted to prove, that is, what the theorem claims.\nTo understand these ingredients, we will analyse Theorem A1.1 and its proof. You have already studied this theorem in Chapter 6. But first, a few comments on proofs in geometry. We often resort to diagrams to help us prove theorems, and this is very important. However, each statement in the proof has to be established using only logic. Very often, we hear students make statements like “Those two angles are equal because in the drawing they look equal\" or \"that angle must be 90°, because the two lines look as if they are perpendicular to each other”. Beware of being deceived by what you see (remember Fig A1.3)! .\nSo now let us go to Theorem A1.1.\nTheorem A1.1: The sum of the interior angles of a triangle is 180°.\nProof: Consider a triangle ABC (see Fig. A1.4).\nWe have to prove that ∠ ABC + ∠ BCA + ∠ CAB = 180° (1)\nConstruct a line DE parallel to BC passing through A.\n(2)\nDE is parallel to BC and AB is a transversal.\nSo, ∠ DAB and ∠ ABC are alternate angles. Therefore, by Theorem 6.2, Chapter 6, they are equal, i.e. ∠ DAB = ∠ ABC\n(3)\nSimilarly, ∠ CAE = ∠ ACB\n(4)\nTherefore, ∠ ABC + ∠ BAC+ ∠ ACB = ∠ DAB +∠ BAC + ∠ CAE\n(5)\nBut ∠ DAB+∠ BAC + ∠ CAE = 180°, since they form a straight angle.\n(6)\nHence, ∠ ABC + ∠ BAC+ ∠ ACB = 180°.\n(7)\nNow, we comment on each step of the proof.\nStep 1: Our theorem is concerned with a property of triangles, so we begin with a triangle.\nStep 2: This is the key idea – the intuitive leap or understanding of how to proceed so as to be able to prove the theorem. Very often geometric proofs require a construction.\nSteps 3 and 4: Here we conclude that ∠ DAE = ∠ ABC and ∠ CAE = ∠ ACB, by using the fact that DE is parallel to BC (our construction), and the previously proved Theorem 6.2, which states that if two parallel lines are intersected by a transversal, then the alternate angles are equal.\nStep 5: Here we use Euclid's axiom (see Chapter 5) which states that: \"If equals are added to equals, the wholes are equal” to deduce ∠ ABC + ∠ BAC+ ∠ ACB = ∠ DAB +∠ BAC + / CAE.\nThat is, the sum of the interior angles of the triangle are equal to the sum of the angles on a straight line.\nStep 6: Here we use the Linear pair axiom of Chapter 6, which states that the angles on a straight line add up to 180°, to show that ∠ DAB +∠ BAC + ∠ CAE = 180°.\nStep 7: We use Euclid's axiom which states that “things which are equal to the same thing are equal to each other\" to conclude that ∠ ABC + ∠ BAC +\n∠ACB = ∠ DAB +∠ BAC + ∠ CAE = 180°. Notice that Step 7 is the claim made in the theorem we set out to prove.\nWe now prove Theorems A1.2 and A1.3 without analysing them.\nTheorem A1.2: The product of two even natural numbers is even.\nProof: Let x and y be any two even natural numbers.\nWe want to prove that xy is even.\nSince x and y are even, they are divisible by 2 and can be expressed in the form\nx = 2m, for some natural number m and y = 2n, for some natural number n.\nThen xy = 4 mn. Since 4 mn is divisible by 2, so is xy.\nTherefore, xy is even.\nTheorem A1.3: The product of any three consecutive even natural numbers is\ndivisible by 16.\nProof: Any three consecutive even numbers will be of the form 2n, 2n + 2 and\n2n + 4, for some natural number n. We need to prove that their product\n2n(2n + 2)(2n + 4) is divisible by 16.\nNow, 2n(2n + 2)(2n + 4) = 2n × 2(n+1) × 2(n + 2)\n= 2 × 2 × 2n(n + 1)(n + 2) = 8n(n + 1)(n + 2).\nNow we have two cases. Either n is even or odd. Let us examine each case.\nSuppose n is even : Then we can write n = 2m, for some natural number m.\nAnd, then 2n(2n + 2)(2n + 4) = 8n(n + 1)(n + 2) = 16m(2m + 1)(2m + 2).\nTherefore, 2n(2n + 2)(2n + 4) is divisible by 16.\nNext, suppose n is odd. Then n + 1 is even and we can write n + 1 = 2r, for some\nnatural number r.\nWe then have : 2n(2n + 2)(2n + 4) = 8n(n + 1)(n + 2)\n= 8(2r – 1) × 2r × (2r + 1)\n= 16r(2r – 1)(2r + 1)\nTherefore, 2n(2n + 2)(2n + 4) is divisible by 16.\nSo, in both cases we have shown that the product of any three consecutive even\nnumbers is divisible by 16.\nWe conclude this chapter with a few remarks on the difference between how\nmathematicians discover results and how formal rigorous proofs are written down. As\nmentioned above, each proof has a key intuitive idea (sometimes more than one).\nIntuition is central to a mathematician's way of thinking and discovering results. Very\noften the proof of a theorem comes to a mathematician all jumbled up. A mathematician\nwill often experiment with several routes of thought, and logic, and examples, before\nshe/he can hit upon the correct solution or proof. It is only after the creative phase\nsubsides that all the arguments are gathered together to form a proper proof.\nIt is worth mentioning here that the great Indian mathematician Srinivasa\nRamanujan used very high levels of intuition to arrive at many of his statements, which\nhe claimed were true. Many of these have turned out be true and are well known theorems. However,\neven to this day mathematicians all over the world\nare struggling to prove (or disprove) some of his claims\n(conjectures).",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 1",
                            "chapter_title": "Proofs in Mathematics",
                            "section_number": "A1.5",
                            "section_title": "What is a Mathematical Proof?",
                            "figure_table_number": "Fig. A1.4, Fig. A1.5"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "Appendix 2",
            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
            "topics": [
                {
                    "section_number": "A2.1",
                    "section_title": "Introduction",
                    "content": "Right from your earlier classes, you have been solving problems related to the real-world around you. For example, you have solved problems in simple interest using the formula for finding it. The formula (or equation) is a relation between the interest and the other three quantities that are related to it, the principal, the rate of interest and the period. This formula is an example of a mathematical model. A mathematical model is a mathematical relation that describes some real-life situation.\nMathematical models are used to solve many real-life situations like:\n• launching a satellite.\n• predicting the arrival of the monsoon.\n• controlling pollution due to vehicles.\n• reducing traffic jams in big cities.\nIn this chapter, we will introduce you to the process of constructing mathematical models, which is called mathematical modelling. In mathematical modelling, we take a real-world problem and write it as an equivalent mathematical problem. We then solve the mathematical problem, and interpret its solution in terms of the real-world problem. After this we see to what extent the solution is valid in the context of the real-world problem. So, the stages involved in mathematical modelling are formulation, solution, interpretation and validation.\nWe will start by looking at the process you undertake when solving word problems, in Section A2.2. Here, we will discuss some word problems that are similar to the ones you have solved in your earlier classes. We will see later that the steps that are used for solving word problems are some of those used in mathematical modelling also.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "A2.1",
                            "section_title": "Introduction",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "A2.2",
                    "section_title": "Review of Word Problems",
                    "content": "In this section, we will discuss some word problems that are similar to the ones that you have solved in your earlier classes. Let us start with a problem on direct variation.\nExample 1: I travelled 432 kilometres on 48 litres of petrol in my car. I have to go by my car to a place which is 180 km away. How much petrol do I need?\nSolution: We will list the steps involved in solving the problem.\nStep 1 : Formulation : You know that farther we travel, the more petrol we require, that is, the amount of petrol we need varies directly with the distance we travel.\nPetrol needed for travelling 432 km = 48 litres\nPetrol needed for travelling 180 km = ?\nMathematical Description : Let\nx = distance I travel\ny = petrol I need\ny varies directly with x.\nSo,\ny = kx, where k is a constant.\nSo,\nI can travel 432 kilometres with 48 litres of petrol.\ny = 48, x = 432.\nTherefore,\nk = y/x = 48/432 = 1/9.\nSince\ny = kx,\ntherefore,\ny = (1/9) x\n(1)\nEquation or Formula (1) describes the relationship between the petrol needed and distance travelled.\nStep 2 : Solution : We want to find the petrol we need to travel 180 kilometres; so, we have to find the value of y when x = 180. Putting x = 180 in (1), we have\ny = 180/9 = 20.\nStep 3: Interpretation : Since y = 20, we need 20 litres of petrol to travel 180 kilometres.\nDid it occur to you that you may not be able to use the formula (1) in all situations? For example, suppose the 432 kilometres route is through mountains and the 180 kilometres route is through flat plains. The car will use up petrol at a faster rate in the first route, so we cannot use the same rate for the 180 kilometres route, where the petrol will be used up at a slower rate. So the formula works if all such conditions that affect the rate at which petrol is used are the same in both the trips. Or, if there is a difference in conditions, the effect of the difference on the amount of petrol needed for the car should be very small. The petrol used will vary directly with the distance travelled only in such a situation. We assumed this while solving the problem.\nExample 2: Suppose Sudhir has invested ₹ 15,000 at 8% simple interest interest per year. With the return from the investment, he wants to buy a washing machine that costs ₹ 19,000. For what period should he invest ₹ 15,000 so that he has enough money to buy a washing machine?\nSolution : Step 1: Formulation of the problem : Here, we know the principal and the rate of interest. The interest is the amount Sudhir needs in addition to 15,000 to buy the washing machine. We have to find the number of years.\nMathematical Description : The formula for simple interest is I = Pnr/100,\nwhere\nP = Principal,\nn = Number of years,\nr% = Rate of interest\nI = Interest earned\nHere,\nthe principal = ₹15,000\nThe money required by Sudhir for buying a washing machine =₹19,000\nSo, the interest to be earned = (19,000 – 15,000) = ₹4,000\nThe number of years for which ₹15,000 is deposited = n\nThe interest on ₹15,000 for n years at the rate of 8% = I\nI = 15000 × n × 8 / 100\nSo,\nI = 1200n\n(1)\ngives the relationship between the number of years and interest, if ₹15000 is invested at an annual interest rate of 8%.\nWe have to find the period in which the interest earned is ₹4000.\nPutting I = 4000 in (1), we have\n4000 = 1200n\n(2)\nStep 2: Solution of the problem : Solving Equation (2), we get\nn = 4000 / 1200 = 4/3 = 1 1/3.\nStep 3: Interpretation : Since n = 1 1/3, and one third of a year is 4 months,\nSudhir can buy a washing machine after 3 years and 4 months.\nCan you guess the assumptions that you have to make in the example above? We have to assume that the interest rate remains the same for the period for which we calculate the interest. Otherwise, the formula I = Pnr/100 will not be valid. We have also assumed that the price of the washing machine does not increase by the time Sudhir has gathered the money.\nExample 3: A motorboat goes upstream on a river and covers the distance between two towns on the riverbank in six hours. It covers this distance downstream in five hours. If the speed of the stream is 2 km/h, find the speed of the boat in still water.\nSolution: Step 1: Formulation : We know the speed of the river and the time taken to cover the distance between two places. We have to find the speed of the boat in still water.\nMathematical Description : Let us write x for the speed of the boat, t for the time taken and y for the distance travelled. Then\ny = tx\nLet d be the distance between the two places.\n(1)\nWhile going upstream, the actual speed of the boat = speed of the boat – speed of the river,\nbecause the boat is travelling against the flow of the river.\nSo, the speed of the boat upstream = (x – 2) km/h\nIt takes 6 hours to cover the distance between the towns upstream. So, from (1),\nwe get\nd = 6(x – 2)\n(2)\nWhen going downstream, the speed of the river has to be added to the speed of the\nboat.\nSo, the speed of the boat downstream = (x + 2) km/h\nThe boat takes 5 hours to cover the same distance downstream. So,\nd = 5(x + 2)\nFrom (2) and (3), we have\n5(x + 2) = 6(x −2)\n(3)\n(4)\nStep 2: Finding the Solution\nSolving for x in Equation (4), we get x = 22.\nStep 3: Interpretation\nSince x = 22, therefore the speed of the motorboat in still water is 22 km/h.\nIn the example above, we know that the speed of the river is not the same everywhere. It flows slowly near the shore and faster at the middle. The boat starts at the shore and moves to the middle of the river. When it is close to the destination, it will slow down and move closer to the shore. So, there is a small difference between the speed of the boat at the middle and the speed at the shore. Since it will be close to the shore for a small amount of time, this difference in speed of the river will affect the speed only for a small period. So, we can ignore this difference in the speed of the river. We can also ignore the small variations in speed of the boat. Also, apart from the speed of the river, the friction between the water and surface of the boat will also affect the actual speed of the boat. We also assume that this effect is very small.\nSo, we have assumed that\n1. The speed of the river and the boat remains constant all the time.\n2. The effect of friction between the boat and water and the friction due to air is negligible.\nWe have found the speed of the boat in still water with the assumptions (hypotheses) above.\nAs we have seen in the word problems above, there are 3 steps in solving a\nword problem. These are\n1. Formulation : We analyse the problem and see which factors have a major\ninfluence on the solution to the problem. These are the relevant factors. In\nour first example, the relevant factors are the distance travelled and petrol\nconsumed. We ignored the other factors like the nature of the route, driving\nspeed, etc. Otherwise, the problem would have been more difficult to solve.\nThe factors that we ignore are the irrelevant factors.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "A2.2",
                            "section_title": "Review of Word Problems",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "",
                    "section_title": "Steps in solving word problems",
                    "content": "We then describe the problem mathematically, in the form of one or more mathematical equations.\n2. Solution: We find the solution of the problem by solving the mathematical equations obtained in Step 1 using some suitable method.\n3. Interpretation : We see what the solution obtained in Step 2 means in the context of the original word problem.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "",
                            "section_title": "Steps in solving word problems",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "A2.3",
                    "section_title": "Some Mathematical Models",
                    "content": "So far, nothing was new in our discussion. In this section, we are going to add another step to the three steps that we have discussed earlier. This step is called validation.\nWhat does validation mean? Let us see. In a real-life situation, we cannot accept a model that gives us an answer that does not match the reality. This process of checking the answer against reality, and modifying the mathematical description if necessary, is called validation. This is a very important step in modelling. We will introduce you to this step in this section.\nFirst, let us look at an example, where we do not have to modify our model after validation.\nExample 4: Suppose you have a room of length 6 m and breadth 5 m. You want to cover the floor of the room with square mosaic tiles of side 30 cm. How many tiles will you need? Solve this by constructing a mathematical model.\nSolution: Formulation : We have to consider the area of the room and the area of a tile for solving the problem. The side of the tile is 0.3 m. Since the length is 6 m, we\ncan fit in 6 / 0.3 = 20 tiles along the length of the room in one row (see Fig. A2.1).\nSince the breadth of the room is 5 metres, we have 5 / 0.3 = 16.67. So, we can fit in\n16 tiles in a column. Since 16 × 0.3 = 4.8, 5 – 4.8 = 0.2 metres along the breadth will\nnot be covered by tiles. This part will have to be covered by cutting the other tiles. The\nbreadth of the floor left uncovered, 0.2 metres, is more than half the length of a tile,\nwhich is 0.3 m. So we cannot break a tile into two equal halves and use both the halves\nto cover the remaining portion.\nMathematical Description : We have:\nTotal number of tiles required = (Number of tiles along the length\n× Number of tiles along the breadth) + Number of tiles along the uncovered area\n(1)\nSolution : As we said above, the number of tiles along the length is 20 and the\nnumber of tiles along the breadth is 16. We need 20 more tiles for the last row. Substituting\nthese values in (1), we get (20 × 16) + 20 = 320 + 20 = 340.\nInterpretation : We need 340 tiles to cover the floor.\nValidation : In real-life, your mason may ask you to buy some extra tiles to\nreplace those that get damaged while cutting them to size. This number will of course\ndepend upon the skill of your mason! But, we need not modify Equation (1) for this.\nThis gives you a rough idea of the number of tiles required. So, we can answer here.\nLet us now look at another situation now.\nExample 5: In the year 2000, 191 countries of the U.N. signed a declaration.\nIn this declaration, the countries agreed to achieve certain development goals by the\nyear 2015. These are called the millennium development goals. One of these goals\nis to promote gender equality. One indicator for deciding whether this goal has been\nachieved is the ratio of girls to boys in primary, secondary and tertiary education.\nIndia, as a signatory to the declaration, is committed to improve this ratio. The data\nfor the percentage of girls who are enrolled in primary schools is given in Table A2.1.\nUsing this data, mathematically describe the rate at which the proportion of girls enrolled\nin primary schools grew. Also, estimate the year by which the enrolment of girls will\nreach 50%.\nSolution : Let us first convert the problem into a mathematical problem.\nStep 1 : Formulation : Table A2.1 gives the enrolment for the years 1991-92,\n1992-93, etc. Since the students join at the beginning of an academic year, we can\ntake the years as 1991, 1992, etc. Let us assume that the percentage of girls who join\nprimary schools will continue to grow at the same rate as the rate in Table A2.1. So,\nthe number of years is important, not the specific years. (To give a similar situation,\nwhen we find the simple interest for, say, ₹ 1500 at the rate of 8% for three years, it\ndoes not matter whether the three-year period is from 1999 to 2002 or from 2001 to\n2004. What is important is the interest rate in the years being considered). Here also,\nwe will see how the enrolment grows after 1991 by comparing the number of years\nthat has passed after 1991 and the enrolment. Let us take 1991 as the 0th year, and\nwrite 1 for 1992 since 1 year has passed in 1992 after 1991. Similarly, we will write 2\nfor 1993, 3 for 1994, etc. So, Table A2.1 will now look like as Table A2.2.\nAt the end of the one-year period from 1991 to 1992, 1992, the enrolment has increased\nby 0.7% from 41.9% to 42.6%. At the end of the second year, this has increased by\n0.1%, from 42.6% to 42.7%. From the table above, we cannot find a definite relationship\nbetween the number of years and percentage. But the increase is fairly steady. Only\nin the first year and in the 10th year there is a jump. The mean of the values is\n(0.7 + 0.1 + 0.2 + 0.2 + 0.1 + 0.3 + 0 + 0.1 + 0.1 + 0.4) / 10 = 0.22\nLet us assume that the enrolment steadily increases at the rate of 0.22 per cent.\nMathematical Description : We have assumed that the enrolment increases\nsteadily at the rate of 0.22% per year.\nSo, the Enrolment Percentage (EP) in the first year = 41.9 + 0.22\nEP in the second year = 41.9 + 0.22 + 0.22 = 41.9 + 2 × 0.22\nEP in the third year = 41.9 + 0.22 + 0.22 + 0.22 = 41.9 + 3 × 0.22\nSo, the enrolment percentage in the nth year = 41.9 + 0.22n, for n ≥ 1.\n(1)\nNow, we also have to find the number of years by which the enrolment will reach\n50%. So, we have to find the value of n in the equation or formula\n50 = 41.9 + 0.22n\n(2)\nStep 2 : Solution : Solving (2) for n, we get\nn = (50 - 41.9) / 0.22 = 8.1 / 0.22 = 36.8\nStep 3: Interpretation : Since the number of years is an integral value, we will\ntake the next higher integer, 37. So, the enrolment percentage will reach 50% in\n1991 + 37 = 2028.\nIn a word problem, we generally stop here. But, since we are dealing with a real-\nlife situation, we have to see to what extent this value matches the real situation.\nStep 4: Validation: Let us check if Formula (2) is in agreement with the reality.\nLet us find the values for the years we already know, using Formula (2), and compare\nit with the known values by finding the difference. The values are given in Table A2.4.\nAs you can see, some of the values given by Formula (2) are less than the actual\nvalues by about 0.3% or even by 0.5%. This can give rise to a difference of about 3 to\n5 years since the increase per year is actually 1% to 2%. We may decide that this\nmuch of a difference is acceptable and stop here. In this case, (2) is our mathematical\nmodel.\nSuppose we decide that this error is quite large, and we have to improve this\nmodel. Then we have to go back to Step 1, the formulation, and change Equation (2).\nLet us do so.\nStep 1: Reformulation : We still assume that the values increase steadily by\n0.22%, but we will now introduce a correction factor to reduce the error. For this, we\nfind the mean of all the errors.\nMean of errors = (0 +0.48 +0.36 +0.34 + 0.32 +0.2 + 0.28 + 0.06 – 0.06 – 0.18 + 0) / 10 = 0.18\nWe take the mean of the errors, and correct our formula by this value.\nRevised Mathematical Description : Let us now add the mean of the errors to\nour formula for enrolment percentage given in (2). So, our corrected formula is:\nEnrolment percentage in the nth year = 41.9 + 0.22n + 0.18 = 42.08 + 0.22n, for\nn≥ 1\n(3)\nWe will also modify Equation (2) appropriately. The new equation for n is:\n50 = 42.08 + 0.22n\n(4)\nStep 2 : Altered Solution : Solving Equation (4) for n, we get\nn = (50 - 42.08) / 0.22 = 7.92 / 0.22 = 36\nStep 3: Interpretation: Since n = 36, the enrolment of girls in primary schools\nwill reach 50% in the year 1991 + 36 = 2027.\nStep 4: Validation: Once again, let us compare the values got by using Formula\n(4) with the actual values. Table A2.5 gives the comparison.\nAs you can see, many of the values that (4) gives are closer to the actual value\nthan the values that (2) gives. The mean of the errors is 0 in this case.\nWe will stop our process here. So, Equation (4) is our mathematical description\nthat gives a mathematical relationship between years and the percentage of enrolment\nof girls of the total enrolment. We have constructed a mathematical model that describes\nthe growth.\nThe process that we have followed in the situation above is called\nmathematical modelling.\nWe have tried to construct a mathematical model with the mathematical tools that\nwe already have. There are better mathematical tools for making predictions from the\ndata we have. But, they are beyond the scope of this course. Our aim in constructing\nthis model is to explain the process of modelling to you, not to make accurate predictions\nat this stage.\nYou may now like to model some real-life situations to check your understanding\nof our discussion so far. Here is an Exercise for you to try.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "A2.3",
                            "section_title": "Some Mathematical Models",
                            "figure_table_number": "Table A2.1, Table A2.2, Table A2.3, Table A2.4, Table A2.5"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "A2.4",
                    "section_title": "The Process of Modelling, its Advantages and Limitations",
                    "content": "Let us now conclude our discussion by drawing out aspects of mathematical modelling\nthat show up in the examples we have discussed. With the background of the earlier\nsections, we are now in a position to give a brief overview of the steps involved in\nmodelling.\nStep 1: Formulation : You would have noticed the difference between the\nformulation part of Example 1 in Section A2.2 and the formulation part of the model\nwe discussed in A2.3. In Example 1, all the information is in a readily usable form. But,\nin the model given in A2.3 this is not so. Further, it took us some time to find a\nmathematical description. We tested our first formula, but found that it was not as\ngood as the second one we got. This is usually true in general, i.e. when trying to\nmodel real-life situations; the first model usually needs to be revised. When we are\nsolving a real-life problem, formulation can require a lot of time. For example, Newton's\nthree laws of motion, which are mathematical descriptions of motion, are simple enough\nto state. But, Newton arrived at these laws after studying a large amount of data and\nthe work the scientists before him had done.\nFormulation involves the following three steps :\n(i) Stating the problem : Often, the problem is stated vaguely. For example,\nthe broad goal is to ensure that the enrolment of boys and girls are equal. This\nmay mean that 50% of the total number of boys of the school-going age and\n50% of the girls of the school-going age should be enrolled. The other way is\nto ensure that 50% of the school-going children are girls. In our problem, we\nhave used the second approach.\n(ii) Identifying relevant factors: Decide which quantities and relationships\nare important for our problem and which are unimportant and can be neglected.\nFor example, in our problem regarding primary schools enrolment, the\npercentage of girls enrolled in the previous year can influence the number of\ngirls enrolled this year. This is because, as more and more girls enrol in\nschools, many more parents will feel they also have to put their daughters in\nschools. But, we have ignored this factor because this may become important\nonly after the enrolment crosses a certain percentage. Also, adding this factor\nmay make our model more complicated.\n(iii) Mathematical Description : Now suppose we are clear about what the\nproblem is and what aspects of it are more relevant than the others. Then we\nhave to find a relationship between the aspects involved in the form of an\nequation, a graph or any other suitable mathematical description. If it is an\nequation, then every important aspect should be represented by a variable in\nour mathematical equation.\nStep 2: Finding the solution : The mathematical formulation does not give the\nsolution. We have to solve this mathematical equivalent of the problem. This is where\nyour mathematical knowledge comes in useful.\nStep 3: Interpretating the solution : The mathematical solution is some value\nor values of the variables in the model. We have to go back to the real-life problem and\nsee what these values mean in the problem.\nStep 4: Validating the solution : As we saw in A2.3, after finding the solution\nwe will have to check whether the solution matches the reality. If it matches, then the\nmathematical model is acceptable. If the mathematical solution does not match, we go\nback to the formulation step again and try to improve our model.\nThis step in the process is one major difference between solving word problems\nand mathematical modelling. This is one of the most important step in modelling that is\nmissing in word problems. Of course, it is possible that in some real-life situations, we\ndo not need to validate our answer because the problem is simple and we get the\ncorrect solution right away. This was so in the first model we considered in A2.3.\nWe have given a summary of the order in which the steps in mathematical modelling\nare carried out in Fig. A2.2 below. Movement from the validation step to the formulation\nstep is shown using a dotted arrow. This is because it may not be necessary to carry\nout this step again.\nNow that you have studied the stages involved in mathematical modelling, let us\ndiscuss some of its aspects.\nThe aim of mathematical modelling is to get some useful information about a real-\nworld problem by converting it into a mathematical problem. This is especially useful\nwhen it is not possible or very expensive to get information by other means such as\ndirect observation or by conducting experiments.\nYou may also wonder why we should undertake mathematical modelling? Let us\nlook at some advantages of modelling. Suppose we want to study the corrosive\neffect of the discharge of the Mathura refinery on the Taj Mahal. We would not like to\ncarry out experiments on the Taj Mahal directly since it may not be safe to do so.\nOf course, we can use a scaled down physical model, but we may need special facilities\nfor this, which may be expensive. Here is where mathematical modelling can be of\ngreat use.\nAgain, suppose we want to know how many primary schools we will need after 5\nyears. Then, we can only solve this problem by using a mathematical model. Similarly,\nit is only through modelling that scientists have been able to explain the existence of so\nmany phenomena.\nYou saw in Section A2.3, that we could have tried to improve the answer in the\nsecond example with better methods. But we stopped because we do not have the\nmathematical tools. This can happen in real-life also. Often, we have to be satisfied\nwith very approximate answers, because mathematical tools are not available. For\nexample, the model equations used in modelling weather are so complex that\nmathematical tools to find exact solutions are not available.\nYou may wonder to what extent we should try to improve our model. Usually, to\nimprove it, we need to take into account more factors. When we do this, we add more\nvariables to our mathematical equations. We may then have a very complicated model\nthat is difficult to use. A model must be simple enough to use. A good model balances\ntwo factors:\n1. Accuracy, i.e., how close it is to reality.\n2. Ease of use.\nFor example, Newton's laws of motion are very simple, but powerful enough to\nmodel many physical situations.\nSo, is mathematical modelling the answer to all our problems? Not quite! It has its\nlimitations.\nThus, we should keep in mind that a model is only a simplification of a real-\nworld problem, and the two are not the same. It is something like the difference\nbetween a map that gives the physical features of a country, and the country itself. We\ncan find the height of a place above the sea level from this map, but we cannot find the\ncharacteristics of the people from it. So, we should use a model only for the purpose it\nis supposed to serve, remembering all the factors we have neglected while constructing\nit. We should apply the model only within the limits where it is applicable. In the later\nclasses, we shall discuss this aspect a little more.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "A2.4",
                            "section_title": "The Process of Modelling, its Advantages and Limitations",
                            "figure_table_number": "Fig.A2.2"
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "section_number": "",
                    "section_title": "Steps in Mathematical Modelling",
                    "content": "1. Formulation :\n(i) Stating the question\n(ii) Identifying the relevant factors\n(iii) Mathematical description\n2. Finding the solution.\n3. Interpretation of the solution in the context of the real-world\nproblem.\n4. Checking/validating to what extent the model is a good\nrepresentation of the problem being studied.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "Appendix 2",
                            "chapter_title": "INTRODUCTION TO MATHEMATICAL MODELLING",
                            "section_number": "",
                            "section_title": "Steps in Mathematical Modelling",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "1",
            "chapter_title": "Number Systems",
            "topics": [
                {
                    "topic": "Introduction",
                    "content": "In Class IX, you have studied about the number systems and that the set of real numbers\nis composed of rational and irrational numbers. You have also learnt about the\nrepresentation of irrational numbers on the number line. Now, we will continue our study\nabout real numbers.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.1",
                            "section_title": "Introduction",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.2 Rational Numbers and their Decimal Expansions",
                    "content": "Let us consider a few examples. Example 1 : Consider 10/3. ... Example 2 : Consider 7/8. ... Example 3 : Consider 1/7. ... Theorem 1.3 : Let x be a rational number whose decimal expansion is terminating. Then x can be expressed in the form p/q, where p and q are coprime, and the prime factorisation of q is of the form 2ⁿ5ᵐ, where n and m are non-negative integers. ... Conversely, let x = p/q be a rational number, where the prime factorisation of q is of the form 2ⁿ5ᵐ, where n and m are non-negative integers. Then x has a decimal expansion which is terminating. ... Theorem 1.4 : Let x be a rational number, whose decimal expansion is non-terminating repeating. Then x can be expressed in the form p/q, where p and q are coprime, and the prime factorisation of q is not of the form 2ⁿ5ᵐ, where n and m are non-negative integers. ... Conversely, let x = p/q be a rational number, where the prime factorisation of q is not of the form 2ⁿ5ᵐ, where n and m are non-negative integers. Then x has a decimal expansion which is non-terminating repeating. ...",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.2",
                            "section_title": "Rational Numbers and their Decimal Expansions",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.3 Irrational Numbers",
                    "content": "In the earlier section, we introduced irrational numbers. Let us explore them a bit more. ... Theorem 1.5 : √2 is irrational. ... Theorem 1.6 : √p is irrational, where p is a prime number. ... Theorem 1.7 : Let x be a rational number and y be an irrational number. Then x + y and x – y are irrational numbers. Also, if x ≠ 0, then xy and x/y are irrational numbers. ...",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.3",
                            "section_title": "Irrational Numbers",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.4 Real Numbers and their Decimal Expansions",
                    "content": "We have seen that rational numbers have either a terminating or a non-terminating repeating decimal expansion. We have also seen that irrational numbers have a non-terminating, non-repeating decimal expansion. ... So, we can say that the decimal expansion of a rational number is either terminating or non-terminating repeating, and the decimal expansion of an irrational number is non-terminating, non-repeating. ... Theorem 1.8 : If we have a sequence of nested intervals (I₁) ⊃ (I₂) ⊃ (I₃) ⊃ ..., where Iₙ = [aₙ, bₙ] and bₙ – aₙ → 0 as n → ∞, then there is exactly one real number which belongs to every interval Iₙ. ...",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.4",
                            "section_title": "Real Numbers and their Decimal Expansions",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition|example",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.5 Number line and Real Numbers",
                    "content": "In Class IX, you have represented some irrational numbers on the number line. Let us\nconsolidate our understanding of real numbers and their representation on the number line.\nThe number line is a continuous line. This means that between any two real numbers, there\nis always a real number. This property is called the density property.",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.5",
                            "section_title": "Number line and Real Numbers",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.6 Operations on Real Numbers",
                    "content": "We have performed operations on rational numbers. Let us see how operations on\nirrational numbers behave. ... Let a and b be positive real numbers. Then: (i) √ab = √a√b (ii) √(a/b) = √a/√b ... The above rules can be used to simplify expressions involving irrational numbers. ... We can also rationalise the denominator of an expression. ...",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.6",
                            "section_title": "Operations on Real Numbers",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory|definition",
                                "exercise_type": ""
                            }
                        }
                    }
                },
                {
                    "topic": "1.7 Powers of Real Numbers",
                    "content": "We have already encountered the following notations: ... These are the laws of exponents. ...",
                    "metadata_of_topic": {
                        "educational_context": {
                            "grade": "9",
                            "subject": "Mathematics",
                            "curriculum_board": "NCERT",
                            "chapter_number": "1",
                            "chapter_title": "Number Systems",
                            "section_number": "1.7",
                            "section_title": "Powers of Real Numbers",
                            "figure_table_number": ""
                        },
                        "source_information": {
                            "ncert": {
                                "source": "NCERT",
                                "book_title": "Mathematics_Textbook_Class_9",
                                "publisher": "NCERT",
                                "language": "English",
                                "content_type": "theory",
                                "exercise_type": ""
                            }
                        }
                    }
                }
            ]
        },
        {
            "chapter_number": "1",
            "chapter_title": "NUMBER SYSTEMS",
            "topics": [
                {
                    "section_number": "1.1",
                    "section_title": "Introduction",
                    "content": "In Class IX, we have learned about the number line and how to represent various types of numbers on it. All real numbers can be represented on the number line. Similarly, every point on the number line represents a real number. This is the reason we call the number line as the real number line.\n\nA real number is either a rational number or an irrational number.\n\nRational numbers are numbers of the form p/q, where p and q are integers and q is not zero. Irrational numbers are numbers that cannot be expressed in the form p/q, where p and q are integers and q is not zero.\n\n1.1.1 Rational Numbers\n\nA number is called a rational number if it can be expressed in the form p/q, where p and q are integers and q != 0.\n\nExamples:\n1/2, 2/3, 3/4, 5/6, 7/8, etc. are all rational numbers.\n\n1.1.2 Irrational Numbers\n\nA number is called an irrational number if it cannot be expressed in the form p/q, where p and q are integers and q != 0.\n\nExamples:\n√2, √3, √5, π, etc. are all irrational numbers.\n\n1.1.3 Real Numbers\n\nReal numbers are numbers that can be represented on the number line. Every real number is either a rational number or an irrational number.\n\nExamples:\n1, 2, 3, 4, 5, 6, 7, 8, 9, 10, etc. are all real numbers.\n\n1.1.4 Operations on Real Numbers\n\nWe can perform the usual arithmetic operations like addition, subtraction, multiplication and division on real numbers. However, some of these operations may lead to results that are either rational or irrational.\n\n1.1.5 Laws of Exponents for Real Numbers\n\nThe laws of exponents for real numbers are as follows:\n\na^m * a^n = a^(m+n)\na^m / a^n = a^(m-n)\n(a^m)^n = a^(m*n)\na^0 = 1\na^1 = a\n\nThese laws are applicable for both rational and irrational numbers.\n\nSummary\n\nIn this chapter, we have learned about rational numbers, irrational numbers and real numbers. We have also studied the operations on real numbers and the laws of exponents for real numbers.\n\nExercises\n\n1. Express the following numbers as fractions:\n   a) 0.5\n   b) 0.75\n   c) 0.25\n\n2. Express the following numbers as decimals:\n   a) 1/2\n   b) 3/4\n   c) 5/6\n\n3. Express the following numbers in the form p/q:\n   a) √2\n   b) √3\n   c) √5\n\n4. Simplify the following:\n   a) (√2 + √3)²\n   b) (√5 - √2)²\n   c) (√7 + √3)(√7 - √3)\n\n5. Rationalise the denominator of the following:\n   a) 1/√2\n   b) 1/√3\n   c) 1/√5"
                },
                {
                    "section_number": "1.2",
                    "section_title": "Irrational Numbers",
                    "content": "An irrational number is a real number that cannot be expressed as a simple fraction. In other words, an irrational number is a number whose decimal representation is non-terminating and non-repeating.\n\nExamples of irrational numbers include:\n\n* The square root of any prime number (e.g., √2, √3, √5, √7, etc.)\n* The square root of any non-perfect square integer (e.g., √6, √8, √10, etc.)\n* Pi (π), approximately 3.14159...\n* Euler's number (e), approximately 2.71828...\n\nProperties of Irrational Numbers:\n\n* The sum or difference of a rational number and an irrational number is irrational.\n  Example: 2 + √3 is irrational.\n\n* The product or quotient of a non-zero rational number and an irrational number is irrational.\n  Example: 3√5 is irrational.\n\n* The sum, difference, product, or quotient of two irrational numbers can be either rational or irrational.\n  Example: √2 * √2 = 2 (rational), but √2 * √3 = √6 (irrational).\n\nWe can also approximate irrational numbers using rational numbers. For example, we often use 22/7 as an approximation for π, but it is not exactly equal to π."
                },
                {
                    "section_number": "1.3",
                    "section_title": "Real Numbers and their Decimal Expansions",
                    "content": "Every real number can be represented on the number line. The decimal expansion of a real number can be either terminating or non-terminating.\n\nTerminating Decimals:\nA decimal expansion is called terminating if it ends after a finite number of digits. For example, 1/2 = 0.5, 1/4 = 0.25.\n\nNon-terminating Decimals:\nA decimal expansion is called non-terminating if it continues indefinitely.\n\nNon-terminating decimals can be of two types:\n\n1. Non-terminating repeating decimals:\n   These decimals have a repeating pattern of digits. For example, 1/3 = 0.333..., 2/3 = 0.666..., 1/7 = 0.142857142857...\n   All rational numbers have either terminating or non-terminating repeating decimal expansions.\n\n2. Non-terminating non-repeating decimals:\n   These decimals do not have a repeating pattern of digits. For example, π = 3.1415926535..., √2 = 1.4142135623...\n   All irrational numbers have non-terminating non-repeating decimal expansions.\n\nRelationship between Rational Numbers and Decimal Expansions:\n\n* A rational number can be expressed as a terminating decimal if and only if the denominator of the fraction (in its lowest terms) contains only powers of 2 and/or 5 in its prime factorization.\n* A rational number can be expressed as a non-terminating repeating decimal if the denominator of the fraction (in its lowest terms) contains prime factors other than 2 or 5.\n\nIrrational Numbers and Decimal Expansions:\n\n* Irrational numbers cannot be expressed as a terminating or a non-terminating repeating decimal. Their decimal expansions are always non-terminating and non-repeating."
                },
                {
                    "section_number": "1.4",
                    "section_title": "Operations on Real Numbers",
                    "content": "The set of real numbers is closed under addition, subtraction, multiplication and division (except division by zero).\n\nLet a and b be two real numbers. Then:\n\n* a + b is a real number\n* a - b is a real number\n* a * b is a real number\n* a / b is a real number, provided b ≠ 0\n\nProperties of operations on real numbers:\n\n1. Commutative Properties:\n   For any two real numbers a and b:\n   a + b = b + a\n   a * b = b * a\n\n2. Associative Properties:\n   For any three real numbers a, b and c:\n   (a + b) + c = a + (b + c)\n   (a * b) * c = a * (b * c)\n\n3. Distributive Property:\n   For any three real numbers a, b and c:\n   a * (b + c) = a * b + a * c\n\n4. Existence of Identity Elements:\n   Additive identity: There exists a real number 0 such that a + 0 = a for every real number a.\n   Multiplicative identity: There exists a real number 1 such that a * 1 = a for every real number a.\n\n5. Existence of Inverse Elements:\n   Additive inverse: For every real number a, there exists a real number -a such that a + (-a) = 0.\n   Multiplicative inverse: For every non-zero real number a, there exists a real number 1/a such that a * (1/a) = 1.\n\nOperations involving square roots:\n\nLet a and b be positive real numbers. Then:\n\n* √(ab) = √a * √b\n* √(a/b) = √a / √b\n* (√a + √b)(√a - √b) = a - b\n* (√a + √b)² = a + 2√(ab) + b\n* (√a - √b)² = a - 2√(ab) + b"
                },
                {
                    "section_number": "1.5",
                    "section_title": "Laws of Exponents for Real Numbers",
                    "content": "Let a > 0 be a real number and m and n be rational numbers. Then:\n\n1. a^m * a^n = a^(m+n)\n   Example: 2² * 2³ = 2^(2+3) = 2⁵ = 32\n\n2. a^m / a^n = a^(m-n)\n   Example: 3⁵ / 3² = 3^(5-2) = 3³ = 27\n\n3. (a^m)^n = a^(m*n)\n   Example: (2³)⁴ = 2^(3*4) = 2¹²\n\n4. a^0 = 1\n   Example: 5⁰ = 1\n\n5. a^1 = a\n   Example: 7¹ = 7\n\n6. a^(-m) = 1 / a^m\n   Example: 2⁻³ = 1 / 2³ = 1/8\n\n7. (a*b)^m = a^m * b^m\n   Example: (2*3)² = 2² * 3² = 4 * 9 = 36\n\n8. (a/b)^m = a^m / b^m\n   Example: (4/2)² = 4² / 2² = 16 / 4 = 4\n\nThese laws are also applicable when a is not positive, provided that the expressions are defined.\n\nExample:\n\nSimplify: 64^(1/6)\n\n64^(1/6) = (2⁶)^(1/6) = 2^(6 * 1/6) = 2¹ = 2\n\nExample:\n\nSimplify: (32)^(1/5)\n\n(32)^(1/5) = (2⁵)^(1/5) = 2^(5 * 1/5) = 2¹ = 2\n\nExample:\n\nSimplify: (125)^(1/3)\n\n(125)^(1/3) = (5³)^(1/3) = 5^(3 * 1/3) = 5¹ = 5\n\nExample:\n\nSimplify: (27)^(-1/3)\n\n(27)^(-1/3) = 1 / (27)^(1/3) = 1 / (3³)^(1/3) = 1 / 3¹ = 1/3"
                }
            ],
            "metadata": {
                "grade": 9,
                "subject": "Mathematics",
                "source": "NCERT"
            }
        }
    ]
}